farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
/**
 * OTA firmware for ESP32-based TFT display
 * Spot Welder – Merged Firmware (Milestone 1) – REFACTORED
 *
 * REFACTOR CHANGES:
 *   - All INA226 sensor code REMOVED (migrated to STM32)
 *   - All charger control code REMOVED (migrated to STM32)
 *   - STATUS2 UART parser added to receive INA226 data from STM32
 *   - UI now displays STM32-sourced VPACK, CELL1-3, ICHG, charger state
 *   - TCP/WiFi bridge KEPT intact
 *
 * I2C COEXISTENCE:
 *   smartdisplay_init() claims I2C_NUM_0 for GT911 touch on GPIO19/GPIO20.
 *   DO NOT call Wire.begin() – it conflicts with smartdisplay's I2C driver.
 *   Wire1 (INA226) bus has been REMOVED – no longer used by ESP32.
 *
 * TOUCH:
 *   The debounced_touchpad_read callback wraps the smartdisplay driver,
 *   adding a state-machine filter with coordinate scaling.  Copied verbatim
 *   from the proven Touch project.
 */

#include <Arduino.h>
#include <ArduinoOTA.h>
#include <DNSServer.h>
#include <ESPmDNS.h>
#include <Preferences.h>
#include <SD.h>      // microSD card (bundled with arduino-esp32 – NOT a lib_deps entry)
#include <SPI.h>     // dedicated SPI bus for the SD card (bundled)
#include <Update.h>  // ESP32 self-flash from a firmware image (bundled)
#include <WebServer.h>
#include <WiFi.h>
#include <esp32_smartdisplay.h>
#include <driver/i2c.h>  // raw GT911 register access for touch-sensitivity
#if defined(DISPLAY_ST7262_PAR)
// RGB-panel runtime controls used for the display-drift / OTA-glitch fix:
//   esp_lcd_rgb_panel_set_pclk()  -> slow the pixel clock during OTA so the
//                                    panel reads PSRAM slower and leaves bus
//                                    bandwidth for the firmware flash writes.
//   esp_lcd_rgb_panel_restart()   -> re-align the scan-out DMA after a drift
//                                    ("permanent shift") without a power cycle.
#include <esp_lcd_panel_rgb.h>
// esp_lcd_panel_disp_on_off() halts/restarts the RGB panel's scan-out so the
// LCD stops streaming the (about-to-be-garbage) PSRAM framebuffer during the
// flash-cache-disabled windows of an OTA write. Used by the OTA hard-blank fix.
#include <esp_lcd_panel_ops.h>
// esp_cache_msync() writes the CPU data cache back to PSRAM. After we memset the
// framebuffer(s) the cleared bytes may still be sitting in cache; the RGB panel
// DMA reads PSRAM directly (bypassing cache), so we must flush cache->PSRAM
// before restarting the scan-out or the DMA can still fetch stale garbage.
#include <esp_cache.h>
#endif
#include <esp_task_wdt.h>  // esp_task_wdt_reset() – feed WDT during STM32 flash
#include <esp_wifi.h>
#include <lv_conf.h>
#include <lvgl.h>
#include <math.h>
#include <string.h>  // memset() for the boot framebuffer clear

#include "ui.h"

// Firmware version string shown on the Setup tab.
#define FW_VERSION "1.0.0"

// =========================
// OTA (over-the-air) firmware update configuration
// =========================
// These must match the [env:esp32-8048S043C-ota] upload settings in
// platformio.ini so `pio run -e esp32-8048S043C-ota -t upload` can reach the
// device over WiFi (espota). The mDNS hostname makes the device reachable at
// "spotwelder.local"; the password gates uploads.
#define OTA_HOSTNAME "spotwelder"
#define OTA_PASSWORD "spotwelder2024"
#define OTA_PORT 3232

// =========================
// Sunton hardware mapping
// =========================
// STM32 data link uses GPIO17/18 (the original, known-good wiring). The dual
// firmware updater drives the STM32 into its ROM bootloader purely in SOFTWARE
// (an ESP32 -> STM32 "BOOTLOADER" UART command that the STM32 application acts
// on), so NO BOOT0/RESET GPIO control lines are needed and these are the only
// pins on the STM32 link. The GT911 touch I2C bus (GPIO19/20) is untouched.
#define STM32_TO_ESP32_PIN 17  // ESP RX  <- STM32 TX
#define ESP32_TO_STM32_PIN 18  // ESP TX  -> STM32 RX

// Touch I2C (I2C_NUM_0) – managed by smartdisplay, DO NOT use Wire
#define TOUCH_SDA 19
#define TOUCH_SCL 20

#define BUTTON_PIN 0  // GPIO0 (BOOT button on Sunton board)

// =========================
// microSD card (SPI) – pins come from the board definition
// (boards/esp32-8048S043C.json: TF_CS=10, TF_SPI_MOSI=11, TF_SPI_SCLK=12,
//  TF_SPI_MISO=13). Guard with fallbacks so the file still compiles if the
// board macros are ever absent.
// =========================
#ifndef TF_CS
#define TF_CS 10
#endif
#ifndef TF_SPI_MOSI
#define TF_SPI_MOSI 11
#endif
#ifndef TF_SPI_SCLK
#define TF_SPI_SCLK 12
#endif
#ifndef TF_SPI_MISO
#define TF_SPI_MISO 13
#endif

// Firmware-image filenames expected at the SD card root.
#define SD_ESP32_FW_PATH "/esp32_firmware.bin"
#define SD_STM32_FW_PATH "/stm32_firmware.bin"

// =========================
// STM32 remote-flash control: SOFTWARE bootloader entry (no GPIO mod)
// -------------------------------------------------------------------------
// There are NO BOOT0/NRST control wires between the ESP32 and the STM32. The
// updater instead asks the running STM32 application to jump into its built-in
// ROM bootloader by sending a "BOOTLOADER" command over the normal UART link
// (sendBootloaderCommand(), below). The STM32 firmware must implement a handler
// that, on receiving this command, calls its jump-to-system-memory routine.
// After flashing, the AN3155 "Go" command (0x21) launches the freshly written
// application — again, with no hardware reset line.
//
// Trade-off: this is software-only, so if the STM32 application is bricked (no
// running firmware to receive the command) there is no GPIO fallback to force
// the bootloader; recovery then needs the STM32's own BOOT0 strap / SWD. The
// GT911 touch I2C bus (GPIO19/20) is never touched by any of this.
// =========================

HardwareSerial STM32Serial(2);

// =========================
// WiFi / TCP
// =========================
// WiFi credentials are NOT hardcoded. They are provisioned at runtime via the
// captive-portal Setup flow and stored in NVS ("wificfg"). See the
// "WiFi provisioning" section below.
String wifi_ssid = "";  // loaded from NVS at boot
String wifi_pass = "";  // loaded from NVS at boot

WiFiServer server(8888);  // STM32<->Flask bridge (STA mode)
WiFiClient client;

// ---- WiFi provisioning state machine ----
enum WifiProvState {
    WIFI_PROV_STA_CONNECTING,  // trying saved creds
    WIFI_PROV_STA_CONNECTED,   // associated, bridge running
    WIFI_PROV_AP_PORTAL        // AP + captive portal up (setup mode)
};
