farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
// ---- Dashboard / Joule-mode mirrored state (from STM32 STATUS) ----
static uint8_t  control_mode = 0;        // 0=TIME, 1=JOULE
static float    joule_target_j = 50.0f;  // configured target energy (J)
static uint16_t joule_max_ms = 40;       // configured max-duration safety (ms)
static float    joule_actual_j = 0.0f;   // live workpiece energy from STATUS (J)

// Session-based calibration age (ESP32 has no RTC/wall clock).
static bool     cal_done_this_session = false;
static uint32_t last_cal_ms = 0;

// ---- Last-weld latched results (from EVENT,WELD_DONE) ----
static bool     last_weld_valid = false;
static bool     last_weld_was_joule = false;
static float    last_weld_target_j = 0.0f;
static float    last_weld_energy_j = 0.0f;
static float    last_weld_accuracy_pct = 0.0f;
static uint32_t last_weld_duration_ms = 0;
static float    last_weld_peak_a = 0.0f;
static float    last_weld_avg_a = 0.0f;
static float    last_weld_lead_loss_j = 0.0f;

bool welding_now = false;
unsigned long last_weld_time = 0;
const unsigned long WELD_COOLDOWN = 500;

// =========================
// STM32 mirrored truth
// =========================
static bool stm_armed = false;
static bool stm_ready = false;
static bool stm_synced = false;
static uint32_t stm_last_status_ms = 0;
static float stm_weld_current = 0.0f;
static float temperature_c = NAN;
static uint32_t last_temp_update_ms = 0;

// =========================
// Phase 1 – deferred boot config
// ====
static bool stm32_booted = false;   // set true on "BOOT," line from STM32
static bool config_sent = false;    // set true after sendBootConfig() runs
static uint32_t setup_done_ms = 0;  // millis() at end of setup()
static const uint32_t BOOT_TIMEOUT_MS = 3000;  // fallback if no BOOT msg
static uint32_t config_sent_ms = 0;  // millis() when sendBootConfig() completed
static uint32_t last_stm32_boot_sync_ms = 0;
static const uint32_t STM32_BOOT_RESYNC_DEBOUNCE_MS = 1500;

// =========================================================================
// Firmware-update completion popup — deferred to the NEXT boot
// -------------------------------------------------------------------------
// A firmware update that succeeds (and the STM32 update in all cases) ends by
// rebooting the ESP32. We must NOT paint the result popup right before the
// reboot: that render lands while the panel/scan-out is about to be torn down,
// and its leftover pixels in PSRAM produced a brief glitchy frame on the way
// back up. Instead we stash the result in RTC memory (which survives a warm
// ESP.restart() but not a power cycle), and the freshly-booted firmware shows
// the popup ~1 s later — only AFTER displayBootStabilize() + the boot drift
// re-syncs have fully settled the display. A magic sentinel guards against the
// uninitialised RTC garbage present on a true cold power-on.
#define FW_BOOT_POPUP_MAGIC 0xF09A57EDUL
RTC_NOINIT_ATTR static uint32_t rtc_fw_popup_magic;
RTC_NOINIT_ATTR static bool rtc_fw_popup_success;
RTC_NOINIT_ATTR static char rtc_fw_popup_device[8];
RTC_NOINIT_ATTR static char rtc_fw_popup_msg[96];

// --- Boot-loop recovery for a stuck FAILURE popup --------------------------
// A failed firmware flash arms a FAIL popup in RTC memory (above) and reboots.
// If the freshly-booted firmware crashes (e.g. watchdog timeout / WiFi netstack
// error) BEFORE it can consume that flag, the flag survives the reset and the
// device wedges in a boot loop, re-detecting the pending FAIL popup on every
// boot. To self-heal we clear the persistent FAIL flag IMMEDIATELY on first
// detection, at the very top of setup() (before the crash-prone display/WiFi
// init). A copy is latched into RAM first so the popup can still be shown once
// on THIS boot if it survives to loop(); even if the boot crashes again, the
// RTC flag is already cleared so the NEXT reboot comes up clean. SUCCESS popups
// are never touched here.

// Latched in setup() from the RTC flag, consumed exactly once in loop() after
// the display has settled. Plain RAM — only meaningful within one boot.
static bool boot_fw_popup_pending = false;
static bool boot_fw_popup_success = false;
static char boot_fw_popup_device[8] = {0};
static char boot_fw_popup_msg[96] = {0};
// How long after setup() completes before the deferred popup is shown. By this
// point the boot framebuffer clear + dual DMA restart have run, so the panel is
// stable. Reduced from 1000ms -> 300ms now that the display is solid from the
// first frame (XIP-from-PSRAM): the operator sees the result almost immediately.
static const uint32_t FW_BOOT_POPUP_DELAY_MS = 300;

// Stash a firmware-update result so the popup is shown on the next boot. Call
// immediately before ESP.restart().
static void armBootFirmwarePopup(bool success, const char* device,
                                 const char* msg) {
    rtc_fw_popup_success = success;
    snprintf(rtc_fw_popup_device, sizeof(rtc_fw_popup_device), "%s",
             device ? device : "");
    snprintf(rtc_fw_popup_msg, sizeof(rtc_fw_popup_msg), "%s", msg ? msg : "");
    rtc_fw_popup_magic = FW_BOOT_POPUP_MAGIC;  // set last: marks the data valid
}

// Forward declarations
static void sendBootConfig();
static void syncSettingsAfterUiReconnect();
static void syncUiConfigFromRuntime();

// =========================
// READY heartbeat
// =========================
static bool uiConnected = false;
static uint32_t lastReadySentMs = 0;
static const uint32_t READY_PERIOD_MS = 1000;

// STATUS forwarding throttle state (shared by parser + command fast-path).
static uint32_t lastStatusForwardMs = 0;
static const uint32_t STATUS_FORWARD_MIN_INTERVAL_MS = 100;

/* ============================================================
 * GT911 TOUCH SENSITIVITY (hardware threshold adjust)
 *
 * smartdisplay_init() already installs the legacy I2C driver on
 * I2C_NUM_0 (SDA=GPIO19, SCL=GPIO20, 400 kHz) for the GT911 controller,
 * so we can issue raw register reads/writes here WITHOUT re-init and
 * WITHOUT touching Wire (which would conflict).
 *
 * GT911 7-bit address = 0x5D (board uses the default ADDR pin level).
 *
 * IMPORTANT (v2 – noise-immune profiles):
 *   The spot welder's high-current switching generates EMI that couples into
 *   the touch panel.  Simply lowering Touch_Level (v1) made the panel MORE
 *   sensitive but also dropped the threshold BELOW the EMI noise floor, so the
 *   controller reported a storm of phantom touches ("bouncing / mind of its
 *   own").  The fix is NOT a lower threshold – it is to keep a MODERATE
 *   threshold and add hardware noise filtering that scales with sensitivity.
 *
 * Each UI sensitivity step (1-10) now selects a full PROFILE that tunes
 * several config registers together:
 *   0x804C  Touch_Number   – forced to 1 (single-finger UI; rejects phantom
 *                            multi-point noise)
 *   0x804F  Shake_Count    – de-jitter confirm samples. We raise the
 *                            touch-DOWN confirm count (low nibble) at high
 *                            sensitivity so a press must persist for several
 *                            scan frames before it registers (kills transient
 *                            EMI spikes). The touch-UP nibble is preserved.
 *   0x8050  Filter         – Normal_Filter coordinate smoothing (low nibble),
 *                            raised at high sensitivity to stop the cursor
 *                            "bouncing around". First_Filter nibble preserved.
 *   0x8052  Noise_Reduction– 0-15, raised at high sensitivity for EMI immunity.
 *   0x8053  Touch_Level    – press threshold (kept in a usable 46-88 band, not
 *                            driven down to the noise floor).
 *   0x8054  Leave_Level    – release threshold, ~16 below Touch_Level for
 *                            solid hysteresis (less release chatter).
 *   0x8047..0x80FE  184 config bytes
 *   0x80FF  Config_Chksum = (~sum(0x8047..0x80FE) + 1) & 0xFF
 *   0x8100  Config_Fresh – write 0x01 to commit the new config
 *
 * We use the safe read-modify-write method: read the whole config block,
 * change ONLY the profile bytes (preserving the high nibbles of Shake_Count /
 * Filter that the factory set), recompute the checksum, then write the block
 * back and set Config_Fresh.  This is the documented, low-risk way to retune
 * the controller at runtime.
 * ============================================================ */

#define GT911_I2C_PORT        I2C_NUM_0
#define GT911_I2C_ADDR_7BIT   0x5D
#define GT911_REG_CONFIG_VER  0x8047  // first byte of config block
#define GT911_REG_TOUCH_NUMBER 0x804C // max touch points (1-5)
#define GT911_REG_SHAKE_COUNT 0x804F  // de-jitter: hi nibble=touch-up, lo=touch-down confirm
#define GT911_REG_FILTER      0x8050  // hi nibble=First_Filter, lo=Normal_Filter (coord smoothing)
#define GT911_REG_NOISE_REDUCE 0x8052 // 0-15: higher = more EMI/noise immunity
#define GT911_REG_TOUCH_LEVEL 0x8053  // press threshold (higher = firmer press needed)
#define GT911_REG_LEAVE_LEVEL 0x8054  // release threshold (must be < Touch_Level)
#define GT911_REG_CONFIG_CHK  0x80FF  // checksum byte
#define GT911_REG_CONFIG_FRESH 0x8100 // commit trigger
#define GT911_CONFIG_LEN      184      // 0x8047..0x80FE inclusive
#define GT911_I2C_TIMEOUT_MS  100

// Read `len` bytes from a 16-bit GT911 register into buf. Returns true on ok.
static bool gt911_read_reg(uint16_t reg, uint8_t* buf, size_t len) {
    uint8_t reg_be[2] = {(uint8_t)(reg >> 8), (uint8_t)(reg & 0xFF)};
    esp_err_t err = i2c_master_write_read_device(
        GT911_I2C_PORT, GT911_I2C_ADDR_7BIT, reg_be, 2, buf, len,
        pdMS_TO_TICKS(GT911_I2C_TIMEOUT_MS));
    return err == ESP_OK;
}

// Write `len` bytes to a 16-bit GT911 register. Returns true on ok.
static bool gt911_write_reg(uint16_t reg, const uint8_t* data, size_t len) {
    uint8_t tx[2 + 256];
    if (len > 256) return false;
    tx[0] = (uint8_t)(reg >> 8);
    tx[1] = (uint8_t)(reg & 0xFF);
    memcpy(tx + 2, data, len);
    esp_err_t err = i2c_master_write_to_device(
        GT911_I2C_PORT, GT911_I2C_ADDR_7BIT, tx, len + 2,
        pdMS_TO_TICKS(GT911_I2C_TIMEOUT_MS));
    return err == ESP_OK;
}

// One tuning profile per UI sensitivity step.  These bundle the threshold with
// the noise-filtering registers so that high sensitivity stays usable under the
// welder's EMI.  All values are deliberately conservative (well within the
// GT911's documented ranges) since they cannot be verified on bench hardware
// from here – the operator can fine-tune after a quick on-device test.
struct Gt911TouchProfile {
    uint8_t touch_level;      // 0x8053 press threshold  (higher = firmer press)
    uint8_t leave_level;      // 0x8054 release threshold (< touch_level)
    uint8_t noise_reduction;  // 0x8052 value 0-15        (higher = more immune)
    uint8_t shake_down;       // 0x804F low nibble 0-15   (touch-down confirm)
    uint8_t filter_norm;      // 0x8050 low nibble 0-15   (coordinate smoothing)
};

