farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
// Index 0 unused; sensitivity 1..10.  As sensitivity rises the threshold drops
// (more responsive) BUT noise-reduction, confirm samples and coordinate
// smoothing all rise to keep it stable against EMI.  Threshold floor is kept at
// 46 (NOT the old 19) so it never sinks into the noise floor.
static const Gt911TouchProfile kTouchProfiles[11] = {
    /* [0] unused      */ {0, 0, 0, 0, 0},
    /* [1] least sens  */ {88, 72, 1, 1, 2},
    /* [2]             */ {82, 66, 1, 1, 2},
    /* [3]             */ {76, 60, 2, 1, 3},
    /* [4]             */ {70, 54, 2, 2, 3},
    /* [5] balanced    */ {64, 48, 3, 2, 4},
    /* [6]             */ {60, 44, 4, 2, 4},
    /* [7]             */ {56, 40, 6, 3, 5},
    /* [8]             */ {52, 36, 8, 3, 6},
    /* [9]             */ {49, 32, 10, 4, 7},
    /* [10] most sens  */ {46, 28, 12, 4, 8},
};

static inline uint8_t clamp_sens(uint8_t sens) {
    if (sens < 1) return 1;
    if (sens > 10) return 10;
    return sens;
}

// Apply a full touch-sensitivity profile to the GT911 by read-modify-writing
// its config block.  Only the profile bytes are changed (high nibbles of the
// Shake_Count / Filter bytes are preserved). Safe: bails out on any I2C error
// and sets Config_Fresh LAST so a half-written config is never committed.
static bool applyTouchSensitivity(uint8_t sens) {
    sens = clamp_sens(sens);
    const Gt911TouchProfile& p = kTouchProfiles[sens];

    // 1) Read the full config block.
    uint8_t cfg[GT911_CONFIG_LEN];
    if (!gt911_read_reg(GT911_REG_CONFIG_VER, cfg, GT911_CONFIG_LEN)) {
        Serial.println(
            "[Touch] GT911 config read FAILED – sensitivity not applied");
        return false;
    }

    // 2) Compute byte offsets into the config block (base = 0x8047).
    const size_t off_tnum  = GT911_REG_TOUCH_NUMBER - GT911_REG_CONFIG_VER;   // 5
    const size_t off_shake = GT911_REG_SHAKE_COUNT  - GT911_REG_CONFIG_VER;   // 8
    const size_t off_filt  = GT911_REG_FILTER       - GT911_REG_CONFIG_VER;   // 9
    const size_t off_noise = GT911_REG_NOISE_REDUCE - GT911_REG_CONFIG_VER;   // 11
    const size_t off_touch = GT911_REG_TOUCH_LEVEL  - GT911_REG_CONFIG_VER;   // 12
    const size_t off_leave = GT911_REG_LEAVE_LEVEL  - GT911_REG_CONFIG_VER;   // 13

    // Build the new bytes, preserving high nibbles where only the low nibble is
    // ours to tune (Touch_Number low 3 bits hold the finger count).
    uint8_t new_tnum  = (uint8_t)((cfg[off_tnum] & 0xF0) | 0x01);  // 1 finger
    uint8_t new_shake = (uint8_t)((cfg[off_shake] & 0xF0) | (p.shake_down & 0x0F));
    uint8_t new_filt  = (uint8_t)((cfg[off_filt]  & 0xF0) | (p.filter_norm & 0x0F));
    uint8_t new_noise = (uint8_t)(p.noise_reduction & 0x0F);
    uint8_t new_touch = p.touch_level;
    uint8_t new_leave = p.leave_level;

    // 3) Skip the (relatively expensive) write if nothing actually changed.
    if (cfg[off_tnum] == new_tnum && cfg[off_shake] == new_shake &&
        cfg[off_filt] == new_filt && cfg[off_noise] == new_noise &&
        cfg[off_touch] == new_touch && cfg[off_leave] == new_leave) {
        Serial.printf(
            "[Touch] GT911 sens %u already applied "
            "(touch=%u leave=%u noise=%u shake=0x%02X filt=0x%02X)\n",
            sens, new_touch, new_leave, new_noise, new_shake, new_filt);
        return true;
    }

    cfg[off_tnum]  = new_tnum;
    cfg[off_shake] = new_shake;
    cfg[off_filt]  = new_filt;
    cfg[off_noise] = new_noise;
    cfg[off_touch] = new_touch;
    cfg[off_leave] = new_leave;

    // 4) Recompute checksum over the 184 config bytes.
    uint8_t sum = 0;
    for (size_t i = 0; i < GT911_CONFIG_LEN; i++) sum += cfg[i];
    uint8_t checksum = (uint8_t)((~sum) + 1);

    // 5) Write the config block back, then checksum, then commit (fresh last).
    if (!gt911_write_reg(GT911_REG_CONFIG_VER, cfg, GT911_CONFIG_LEN)) {
        Serial.println("[Touch] GT911 config write FAILED");
        return false;
    }
    if (!gt911_write_reg(GT911_REG_CONFIG_CHK, &checksum, 1)) {
        Serial.println("[Touch] GT911 checksum write FAILED");
        return false;
    }
    uint8_t fresh = 0x01;
    if (!gt911_write_reg(GT911_REG_CONFIG_FRESH, &fresh, 1)) {
        Serial.println("[Touch] GT911 config-fresh write FAILED");
        return false;
    }
    Serial.printf(
        "[Touch] GT911 sens=%u applied: Touch_Level=%u Leave_Level=%u "
        "Noise=%u Shake=0x%02X Filter=0x%02X\n",
        sens, new_touch, new_leave, new_noise, new_shake, new_filt);
    return true;
}

/* ============================================================
 * TOUCH FILTER / DEBOUNCE  (verbatim from proven Touch project)
 * ============================================================ */

#define TOUCH_MIN_PRESS_MS 30
#define TOUCH_DEBOUNCE_MS 80
#define TOUCH_RELEASE_DEBOUNCE_MS 40
#define TOUCH_SMOOTH_FACTOR 0.3f

#define GT911_RAW_X_MAX 470
#define GT911_RAW_Y_MAX 265
#define DISPLAY_RES_X 800
#define DISPLAY_RES_Y 480

#define TOUCH_MAX_JUMP_PX 100

enum TouchState {
    TOUCH_IDLE,
    TOUCH_PENDING_PRESS,
    TOUCH_PRESSED,
    TOUCH_PENDING_RELEASE
};

static struct {
    TouchState state;
    uint32_t state_enter_ms;
    uint32_t last_press_ms;
    float smooth_x, smooth_y;
    int16_t last_raw_x, last_raw_y;
    bool has_prev_coords;
    uint32_t tap_count;
    uint32_t touch_reads;
    uint32_t rejected_noise;
} touch_filter = {};

static lv_indev_read_cb_t original_read_cb = nullptr;

// RAW physical touch state, updated on every indev read BEFORE the
// press/release debounce filter runs.  The UI hold-to-repeat logic reads this
// (via touch_is_physically_down()) so it can stop incrementing the instant the
// finger physically lifts, instead of waiting out TOUCH_RELEASE_DEBOUNCE_MS
// (during which LVGL still reports PRESSED).  That debounce is what caused the
// +/- overshoot after release.  Kept volatile: written in the indev read,
// read from the LVGL event handlers (same task, but be explicit).
volatile bool g_touch_phys_down = false;

// Exposed to ui.cpp (see extern declaration there).
bool touch_is_physically_down() { return g_touch_phys_down; }

static void debounced_touchpad_read(lv_indev_t* indev, lv_indev_data_t* data) {
    touch_filter.touch_reads++;

    lv_indev_data_t raw_data = {};
    raw_data.state = LV_INDEV_STATE_RELEASED;
    raw_data.point.x = 0;
    raw_data.point.y = 0;
    raw_data.continue_reading = false;

    if (original_read_cb) {
        original_read_cb(indev, &raw_data);
    }

