farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
    bool touched = (raw_data.state == LV_INDEV_STATE_PRESSED);
    // Publish the RAW (un-debounced) physical state for the UI repeat logic.
    g_touch_phys_down = touched;
    int16_t raw_x = raw_data.point.x;
    int16_t raw_y = raw_data.point.y;

    if (touched) {
        touch_filter.last_raw_x = raw_x;
        touch_filter.last_raw_y = raw_y;
    }

    int16_t tx = (int16_t)((int32_t)raw_x * DISPLAY_RES_X / GT911_RAW_X_MAX);
    int16_t ty = (int16_t)((int32_t)raw_y * DISPLAY_RES_Y / GT911_RAW_Y_MAX);

    if (tx < 0) tx = 0;
    if (ty < 0) ty = 0;
    if (tx >= DISPLAY_RES_X) tx = DISPLAY_RES_X - 1;
    if (ty >= DISPLAY_RES_Y) ty = DISPLAY_RES_Y - 1;

    uint32_t now = millis();

    switch (touch_filter.state) {
        case TOUCH_IDLE:
            if (touched) {
                touch_filter.smooth_x = (float)tx;
                touch_filter.smooth_y = (float)ty;
                touch_filter.state = TOUCH_PENDING_PRESS;
                touch_filter.state_enter_ms = now;
            }
            data->state = LV_INDEV_STATE_RELEASED;
            data->point.x = (int16_t)touch_filter.smooth_x;
            data->point.y = (int16_t)touch_filter.smooth_y;
            break;

        case TOUCH_PENDING_PRESS:
            if (!touched) {
                touch_filter.state = TOUCH_IDLE;
                touch_filter.state_enter_ms = now;
                touch_filter.rejected_noise++;
                data->state = LV_INDEV_STATE_RELEASED;
                data->point.x = (int16_t)touch_filter.smooth_x;
                data->point.y = (int16_t)touch_filter.smooth_y;
            } else {
                float alpha = TOUCH_SMOOTH_FACTOR;
                touch_filter.smooth_x =
                    alpha * (float)tx + (1.0f - alpha) * touch_filter.smooth_x;
                touch_filter.smooth_y =
                    alpha * (float)ty + (1.0f - alpha) * touch_filter.smooth_y;

                if ((now - touch_filter.state_enter_ms) >= TOUCH_MIN_PRESS_MS) {
                    if ((now - touch_filter.last_press_ms) >=
                        TOUCH_DEBOUNCE_MS) {
                        touch_filter.state = TOUCH_PRESSED;
                        touch_filter.state_enter_ms = now;
                        touch_filter.last_press_ms = now;
                        touch_filter.tap_count++;

                        data->point.x = (int16_t)touch_filter.smooth_x;
                        data->point.y = (int16_t)touch_filter.smooth_y;
                        data->state = LV_INDEV_STATE_PRESSED;
                    } else {
                        touch_filter.state = TOUCH_IDLE;
                        touch_filter.rejected_noise++;
                        data->state = LV_INDEV_STATE_RELEASED;
                        data->point.x = (int16_t)touch_filter.smooth_x;
                        data->point.y = (int16_t)touch_filter.smooth_y;
                    }
                } else {
                    data->state = LV_INDEV_STATE_RELEASED;
                    data->point.x = (int16_t)touch_filter.smooth_x;
                    data->point.y = (int16_t)touch_filter.smooth_y;
                }
            }
            break;

        case TOUCH_PRESSED:
            if (!touched) {
                touch_filter.state = TOUCH_PENDING_RELEASE;
                touch_filter.state_enter_ms = now;
                data->point.x = (int16_t)touch_filter.smooth_x;
                data->point.y = (int16_t)touch_filter.smooth_y;
                data->state = LV_INDEV_STATE_PRESSED;
            } else {
                float alpha = TOUCH_SMOOTH_FACTOR;
                float new_x =
                    alpha * (float)tx + (1.0f - alpha) * touch_filter.smooth_x;
                float new_y =
                    alpha * (float)ty + (1.0f - alpha) * touch_filter.smooth_y;

                if (TOUCH_MAX_JUMP_PX > 0) {
                    float dx = new_x - touch_filter.smooth_x;
                    float dy = new_y - touch_filter.smooth_y;
                    float dist = sqrtf(dx * dx + dy * dy);
                    if (dist > TOUCH_MAX_JUMP_PX) {
                        new_x = (float)tx;
                        new_y = (float)ty;
                    }
                }

                touch_filter.smooth_x = new_x;
                touch_filter.smooth_y = new_y;

                if (touch_filter.smooth_x < 0) touch_filter.smooth_x = 0;
                if (touch_filter.smooth_y < 0) touch_filter.smooth_y = 0;
                if (touch_filter.smooth_x > 799) touch_filter.smooth_x = 799;
                if (touch_filter.smooth_y > 479) touch_filter.smooth_y = 479;

                data->point.x = (int16_t)touch_filter.smooth_x;
                data->point.y = (int16_t)touch_filter.smooth_y;
                data->state = LV_INDEV_STATE_PRESSED;
            }
            break;

        case TOUCH_PENDING_RELEASE:
            if (touched) {
                touch_filter.state = TOUCH_PRESSED;
                touch_filter.state_enter_ms = now;

                float alpha = TOUCH_SMOOTH_FACTOR;
                touch_filter.smooth_x =
                    alpha * (float)tx + (1.0f - alpha) * touch_filter.smooth_x;
                touch_filter.smooth_y =
                    alpha * (float)ty + (1.0f - alpha) * touch_filter.smooth_y;

                data->point.x = (int16_t)touch_filter.smooth_x;
                data->point.y = (int16_t)touch_filter.smooth_y;
                data->state = LV_INDEV_STATE_PRESSED;
            } else if ((now - touch_filter.state_enter_ms) >=
                       TOUCH_RELEASE_DEBOUNCE_MS) {
                touch_filter.state = TOUCH_IDLE;
                touch_filter.state_enter_ms = now;
                touch_filter.has_prev_coords = false;
                data->state = LV_INDEV_STATE_RELEASED;
                data->point.x = (int16_t)touch_filter.smooth_x;
                data->point.y = (int16_t)touch_filter.smooth_y;
            } else {
                data->point.x = (int16_t)touch_filter.smooth_x;
                data->point.y = (int16_t)touch_filter.smooth_y;
                data->state = LV_INDEV_STATE_PRESSED;
            }
            break;
    }

