farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
    data->continue_reading = false;
}

// =========================
// Forward declarations
// =========================
void sendToPi(const String& msg);
void forwardToStm32(const String& line);
void updateScreenDisplay();
void pollStm32Uart();
void processCommand(String cmd);
void ensureWiFiAndServer();
void setUiConnected(bool connected);
void serviceReadyHeartbeat();
void requestStm32Status();

void handleButton();

String buildStatus();

static void save_recipe_to_nvs();
static void save_lead_resistance_to_nvs();
static void load_lead_resistance_from_nvs();
static void save_weld_count_to_nvs();
static void load_weld_count_from_nvs();
static void sendLeadResistanceToStm32(float ohms);

// =========================
// Helpers
// =========================
static bool extractFieldValue(const String& line, const String& key,
                              String& out) {
    int idx = line.indexOf(key);
    if (idx < 0) return false;

    int start = idx + key.length();
    int end = line.indexOf(',', start);
    if (end < 0) end = line.length();

    out = line.substring(start, end);
    out.trim();
    return out.length() > 0;
}

static bool extractIntField(const String& line, const String& key, int& out) {
    String s;
    if (!extractFieldValue(line, key, s)) return false;
    out = s.toInt();
    return true;
}

static bool extractFloatField(const String& line, const String& key,
                              float& out) {
    String s;
    if (!extractFieldValue(line, key, s)) return false;
    if (s == "ERR" || s == "NaN") return false;
    out = s.toFloat();
    return true;
}

static inline bool isNoisyKeepaliveLine(const String& s) {
    return s.startsWith("ACK,READY");
}

// =========================
// Status builder
// =========================
/**
 * buildStatus() - System state packet
 *
 * NOTE: Voltage telemetry is NOT included here.
 * All voltages are sent via STATUS2 only to ensure
 * Flask web UI and ESP32 TFT display stay in sync.
 *
 * Including voltages in both STATUS and STATUS2 caused
 * display mismatch due to cached values confusing the
 * 20mV display smoother.
 */
String buildStatus() {
    bool enabled = stm_armed;

    String state;
    if (!enabled) {
        state = "DISABLED";
    } else if (welding_now) {
        state = "WELDING";
    } else if (stm_charger_on) {
        state = "CHARGING";
    } else {
        state = "IDLE";
    }

    bool temp_stale = (millis() - last_temp_update_ms) > 5000;
    String t_str = (!temp_stale && isfinite(temperature_c))
                       ? String(temperature_c, 1)
                       : "ERR";

    unsigned long now = millis();
    long cooldown_ms = (long)(WELD_COOLDOWN - (now - last_weld_time));
    if (cooldown_ms < 0) cooldown_ms = 0;

    float iweld = (fabs(stm_weld_current) < 0.002f) ? 0.0f : stm_weld_current;

    String status = "STATUS";
    status += ",enabled=" + String(enabled ? 1 : 0);
    status += ",armed=" + String(stm_armed ? 1 : 0);
    status += ",ready=" + String(stm_ready ? 1 : 0);
    status += ",welding=" + String(welding_now ? 1 : 0);
    status += ",state=" + state;
    status += ",iweld=" + String(iweld, 3);
    status += ",energy_cap_j=" + String(energy_cap_j, 3);
    status += ",energy_weld_j=" + String(energy_weld_j, 3);
    status += ",energy_loss_j=" + String(energy_loss_j, 3);
    status += ",temp=" + t_str;
    status += ",ina_ok=" + String(stm_ina_ok ? 1 : 0);
    status += ",charger_on=" + String(stm_charger_on ? 1 : 0);
    status += ",cooldown_ms=" + String(cooldown_ms);
    status += ",pulse_ms=" + String(weld_d1);
    status += ",power_pct=" + String(weld_power_pct);
    status += ",preheat_en=" + String(preheat_enabled ? 1 : 0);
    status += ",preheat_ms=" + String(preheat_ms);
    status += ",preheat_pct=" + String(preheat_pct);
    status += ",preheat_gap_ms=" + String(preheat_gap_ms);
    status += ",lead_r_ohm=" + String(lead_resistance_ohms, 6);
    status += ",lead_r_mohm=" + String(lead_resistance_ohms * 1000.0f, 3);
    status += ",mode=" + String(weld_mode);
    status += ",d1=" + String(weld_d1);
    status += ",gap1=" + String(weld_gap1);
    status += ",d2=" + String(weld_d2);
    status += ",gap2=" + String(weld_gap2);
    status += ",d3=" + String(weld_d3);
    status += ",trigger_mode=" + String(trigger_mode);
    status += ",contact_hold_steps=" + String(contact_hold_steps);
    status += ",contact_with_pedal=" + String(contact_with_pedal ? 1 : 0);
    status += ",weld_count=" + String(weld_count);

    // Control mode (0=TIME, 1=JOULE) + Joule targets.  The Flask dashboard
    // reads control_mode to show TIME vs JOULE; without this field it can never
    // learn the mode and stays out of sync with the on-device display.
    status += ",control_mode=" + String(control_mode);
    status += ",joule_target_j=" + String(joule_target_j, 1);
    status += ",joule_max_ms=" + String(joule_max_ms);

    // ---- WiFi info (mirrors the Setup tab; consumed by the Flask dashboard) ----
    // The Flask server has no other way to know the ESP32's SSID/IP/RSSI, so we
    // forward the same values shown on the on-device Setup tab.
    {
        bool wc_connected;
        bool wc_ap;
        String wc_ssid;
        String wc_ip;
        int    wc_rssi = 0;
        if (wifi_prov_state == WIFI_PROV_AP_PORTAL) {
            wc_connected = true;            // soft-AP is up (setup mode)
            wc_ap        = true;
            wc_ssid      = ap_ssid_str;
            wc_ip        = WiFi.softAPIP().toString();
        } else if (WiFi.status() == WL_CONNECTED) {
            wc_connected = true;
            wc_ap        = false;
            wc_ssid      = WiFi.SSID();
            wc_ip        = WiFi.localIP().toString();
            wc_rssi      = WiFi.RSSI();
        } else {
            wc_connected = false;
            wc_ap        = false;
            wc_ssid      = wifi_ssid;       // the network we are trying to join
            wc_ip        = "";
        }
        // Protect the CSV k=v parser: SSIDs may legally contain ',' or '='.
        wc_ssid.replace(",", " ");
        wc_ssid.replace("=", " ");
        status += ",wifi_connected=" + String(wc_connected ? 1 : 0);
        status += ",wifi_ap_mode="   + String(wc_ap ? 1 : 0);
        status += ",wifi_ssid="      + wc_ssid;
        status += ",wifi_ip="        + wc_ip;
        status += ",wifi_rssi="      + String(wc_rssi);
    }

    // ---- System info (mirrors the Setup tab System section) ----
    status += ",fw_version=" + String(FW_VERSION);
    {
        String chip = String(ESP.getChipModel());
        chip.replace(",", " ");
        chip.replace("=", " ");
        status += ",chip_model="  + chip;
    }
    status += ",flash_size=" + String((uint32_t)ESP.getFlashChipSize());
    status += ",free_heap="  + String((uint32_t)ESP.getFreeHeap());
    status += ",uptime_s="   + String((uint32_t)(millis() / 1000UL));

