farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
        // Show the live progress modal. The screen stays ON for the whole
        // transfer now (XIP-from-PSRAM), so the operator watches a real bar
        // instead of a black screen.
        ota_last_drawn_pct = -1;  // reset throttle for this transfer
        show_firmware_progress("ESP32", 0, "Downloading...");
    });

    ArduinoOTA.onEnd([]() {
        Serial.println("\n[OTA] Update complete - rebooting");
        show_firmware_progress("ESP32", 100, "Update complete - rebooting...");
        // The device reboots automatically after this callback returns; the
        // clean boot re-initialises the display + restores the full UI.
    });

    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
        int percent =
            (total > 0) ? (int)((progress * 100ULL) / total) : 0;
        Serial.printf("[OTA] Progress: %d%%\r", percent);
        // THROTTLE: ArduinoOTA fires this per packet (1000+ times). Each repaint
        // is a full-frame PSRAM->LCD flush that fights the flash writes, so only
        // repaint when the percent advances by >= 2 (always draw the final 100%).
        if (percent >= ota_last_drawn_pct + 2 || percent >= 100) {
            ota_last_drawn_pct = percent;
            show_firmware_progress("ESP32", percent, "Writing firmware...");
        }
    });

    ArduinoOTA.onError([](ota_error_t error) {
        ota_in_progress = false;
        Serial.printf("[OTA] Error[%u]: ", error);
        const char* msg = "Update failed!";
        if (error == OTA_AUTH_ERROR) {
            Serial.println("Auth Failed");
            msg = "Auth Failed!";
        } else if (error == OTA_BEGIN_ERROR) {
            Serial.println("Begin Failed");
            msg = "Begin Failed!";
        } else if (error == OTA_CONNECT_ERROR) {
            Serial.println("Connect Failed");
            msg = "Connect Failed!";
        } else if (error == OTA_RECEIVE_ERROR) {
            Serial.println("Receive Failed");
            msg = "Receive Failed!";
        } else if (error == OTA_END_ERROR) {
            Serial.println("End Failed");
            msg = "End Failed!";
        }
        // OTA aborted: the device keeps running. Show the error on the live
        // progress modal briefly, then tear it down and return to the UI.
        show_firmware_progress("ESP32", 0, msg);
        delay(3000);
        hide_firmware_progress();
    });

    ArduinoOTA.begin();
    Serial.printf("[OTA] Ready - host '%s.local' port %d\n", OTA_HOSTNAME,
                  OTA_PORT);
}

// Start mDNS + OTA once WiFi (STA) is up. Idempotent: safe to call again after
// a WiFi reconnect — mDNS is torn down and restarted, OTA re-armed.
static void startNetworkServices() {
    static bool ota_initialized = false;

    // (Re)start the mDNS responder so the device answers to "spotwelder.local".
    MDNS.end();
    if (MDNS.begin(OTA_HOSTNAME)) {
        Serial.println("[mDNS] responder started: " OTA_HOSTNAME ".local");
    } else {
        Serial.println("[mDNS] failed to start responder");
    }

    // ArduinoOTA only needs to be set up once; begin() re-arms its listener.
    if (!ota_initialized) {
        setupOTA();
        ota_initialized = true;
    } else {
        ArduinoOTA.begin();
    }
}

// =========================
// WiFi / server maintenance — drives the provisioning state machine.
// Called every loop().
// =========================
void ensureWiFiAndServer() {
    static unsigned long last_retry = 0;
    static unsigned long last_ui_refresh = 0;
    static bool server_started = false;

    uint32_t now = millis();

    // Periodically refresh WiFi info on the UI (RSSI/IP can drift).
    if (now - last_ui_refresh > 3000) {
        last_ui_refresh = now;
        pushWifiInfoToUi(true);
    }

    switch (wifi_prov_state) {
        case WIFI_PROV_AP_PORTAL:
            dnsServer.processNextRequest();
            portalServer.handleClient();
            if (wifi_creds_just_saved) {
                // New creds arrived from the portal: tear down AP, connect.
                Serial.println("[WiFi] New creds saved -> switching to STA");
                stopApPortal();
                ui_hide_wifi_setup();
                startStaConnect();
            }
            return;

        case WIFI_PROV_STA_CONNECTING:
            if (WiFi.status() == WL_CONNECTED) {
                Serial.println("[WiFi] Connected - IP: " +
                               WiFi.localIP().toString());
                wifi_prov_state = WIFI_PROV_STA_CONNECTED;
                pushWifiInfoToUi(true);
                return;
            }
            // Timed out waiting for the saved network -> fall back to portal.
            if (now - wifi_sta_attempt_start_ms > WIFI_STA_CONNECT_TIMEOUT_MS) {
                Serial.println(
                    "[WiFi] STA connect timed out -> AP portal fallback");
                startApPortal();
            }
            return;

        case WIFI_PROV_STA_CONNECTED:
            if (WiFi.status() == WL_CONNECTED) {
                if (!server_started) {
                    Serial.println("✅ WiFi connected - IP: " +
                                   WiFi.localIP().toString());
                    Serial.println("Starting TCP server on port 8888...");
                    server.begin();
                    server.setNoDelay(true);
                    server_started = true;

                    // Now that STA is up, (re)start mDNS + arm OTA so the
                    // device is flashable over WiFi at "spotwelder.local".
                    startNetworkServices();
                }
                return;
            }
            // Lost connection -> retry STA, then portal-fallback via timeout.
            server_started = false;
            server.stop();
            if (client) client.stop();
            setUiConnected(false);
            if (now - last_retry > 5000) {
                last_retry = now;
                Serial.println("⚠️ WiFi lost; reconnecting...");
                startStaConnect();
            }
            return;
    }
}

// =========================
// UI arm toggle callback
// =========================
static void onArmToggle(bool arm) {
    forwardToStm32(String("ARM,") + (arm ? "1" : "0"));
}

// =========================
// UI recipe apply callback (Phase 2B)
// =========================
static void onRecipeApply(uint8_t mode, uint16_t d1, uint16_t gap1, uint16_t d2,
                          uint16_t gap2, uint16_t d3, uint8_t power_pct_val,
                          bool preheat_en, uint16_t ph_ms, uint8_t ph_pct,
                          uint16_t ph_gap_ms) {
    char buf[80];

