farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
    // SET_PULSE – reuse existing processCommand path (updates locals + forwards
    // to STM32)
    snprintf(buf, sizeof(buf), "SET_PULSE,%d,%d,%d,%d,%d,%d", mode, d1, gap1,
             d2, gap2, d3);
    processCommand(String(buf));

    // SET_POWER
    snprintf(buf, sizeof(buf), "SET_POWER,%d", power_pct_val);
    processCommand(String(buf));

    // SET_PREHEAT
    snprintf(buf, sizeof(buf), "SET_PREHEAT,%d,%d,%d,%d", preheat_en ? 1 : 0,
             ph_ms, ph_pct, ph_gap_ms);
    processCommand(String(buf));

    Serial.println("[Recipe] Applied via touch UI");

    // Persist recipe to NVS so it can be restored on boot
    save_recipe_to_nvs();
}

// =========================
// Config Persistence (NVS via Preferences)
// =========================
static Preferences prefs;

static void apply_brightness(uint8_t level) {
    // Brightness delta guard – skip if unchanged
    static int8_t last_brightness = -1;  // -1 = never set
    if ((int8_t)level == last_brightness) return;
    last_brightness = (int8_t)level;

    float val;
    switch (level) {
        case 0:
            val = 0.3f;
            break;  // LOW
        case 1:
            val = 0.6f;
            break;  // MED
        case 2:
            val = 1.0f;
            break;  // HIGH
        default:
            val = 1.0f;
            break;
    }
    smartdisplay_lcd_set_backlight(val);
    Serial.printf("[Config] Brightness set to %s (%.1f)\n",
                  level == 0   ? "LOW"
                  : level == 1 ? "MED"
                               : "HIGH",
                  (double)val);
}

static float clamp_lead_r_mohm_ui(float value) {
    float clamped = value;
    if (!isfinite(clamped)) clamped = UI_LEAD_R_DEFAULT_MOHM;
    if (clamped < UI_LEAD_R_MIN_MOHM) clamped = UI_LEAD_R_MIN_MOHM;
    if (clamped > UI_LEAD_R_MAX_MOHM) clamped = UI_LEAD_R_MAX_MOHM;
    return clamped;
}

static void save_config_to_nvs(const ConfigState& cfg) {
    prefs.begin("weldcfg", false);
    prefs.putBool("holdRepeat", cfg.hold_to_repeat);
    prefs.putUChar("timeStep", cfg.time_step_ms);
    prefs.putUChar("powerStep", cfg.power_step_pct);
    prefs.putBool("loadLast", cfg.load_last_on_boot);
    prefs.putUChar("bright", cfg.brightness);
    prefs.putBool("cwPedal", cfg.contact_with_pedal);
    prefs.putUChar("trigMode", trigger_mode);
    prefs.putUChar("holdSteps", cfg.contact_hold_steps);
    prefs.putFloat("leadRmohm", clamp_lead_r_mohm_ui(cfg.lead_resistance_mohm));
    prefs.putUChar("touchSens", cfg.touch_sensitivity);
    prefs.end();
    Serial.println("[Config] Saved to NVS");
}

static ConfigState load_config_from_nvs() {
    ConfigState cfg = config_defaults();
    prefs.begin("weldcfg", true);  // read-only
    cfg.hold_to_repeat = prefs.getBool("holdRepeat", cfg.hold_to_repeat);
    cfg.time_step_ms = prefs.getUChar("timeStep", cfg.time_step_ms);
    cfg.power_step_pct = prefs.getUChar("powerStep", cfg.power_step_pct);
    cfg.load_last_on_boot = prefs.getBool("loadLast", cfg.load_last_on_boot);
    cfg.brightness = prefs.getUChar("bright", cfg.brightness);
    cfg.contact_with_pedal = prefs.getBool("cwPedal", cfg.contact_with_pedal);

    trigger_mode = prefs.getUChar("trigMode", trigger_mode);
    cfg.contact_hold_steps =
        prefs.getUChar("holdSteps", cfg.contact_hold_steps);
    cfg.touch_sensitivity =
        prefs.getUChar("touchSens", cfg.touch_sensitivity);
    if (cfg.touch_sensitivity < 1 || cfg.touch_sensitivity > 10)
        cfg.touch_sensitivity = 5;

    // Prefer consolidated weldcfg key; fallback to legacy namespace key.
    bool has_lead_r_in_weldcfg = prefs.isKey("leadRmohm");
    if (has_lead_r_in_weldcfg) {
        cfg.lead_resistance_mohm =
            prefs.getFloat("leadRmohm", cfg.lead_resistance_mohm);
    }
    contact_hold_steps = cfg.contact_hold_steps;  // sync global

    prefs.end();

    if (!has_lead_r_in_weldcfg) {
        prefs.begin("spotwelder", true);
        cfg.lead_resistance_mohm =
            prefs.getFloat("lead_r_mohm", UI_LEAD_R_DEFAULT_MOHM);
        prefs.end();
    }

    cfg.lead_resistance_mohm = clamp_lead_r_mohm_ui(cfg.lead_resistance_mohm);
    lead_resistance_ohms = cfg.lead_resistance_mohm / 1000.0f;

    Serial.println("[Config] Loaded from NVS");
    return cfg;
}

static void save_recipe_to_nvs() {
    prefs.begin("weldrecipe", false);
    prefs.putUChar("mode", weld_mode);
    prefs.putUShort("d1", weld_d1);
    prefs.putUShort("gap1", weld_gap1);
    prefs.putUShort("d2", weld_d2);
    prefs.putUShort("gap2", weld_gap2);
    prefs.putUShort("d3", weld_d3);
    prefs.putUChar("power", weld_power_pct);
    prefs.putBool("phEn", preheat_enabled);
    prefs.putUShort("phMs", preheat_ms);
    prefs.putUChar("phPct", preheat_pct);
    prefs.putUShort("phGap", preheat_gap_ms);
    prefs.end();
    Serial.println("[Config] Recipe saved to NVS");
}

static void save_lead_resistance_to_nvs() {
    float lead_r_mohm = clamp_lead_r_mohm_ui(lead_resistance_ohms * 1000.0f);

    // New consolidated location with other config values.
    prefs.begin("weldcfg", false);
    prefs.putFloat("leadRmohm", lead_r_mohm);
    prefs.end();

    // Legacy key kept for backward compatibility during migration.
    prefs.begin("spotwelder", false);
    prefs.putFloat("lead_r_mohm", lead_r_mohm);
    prefs.end();

    Serial.printf("[Config] Lead resistance saved: %.3f mOhm\n",
                  (double)lead_r_mohm);
}

static void load_lead_resistance_from_nvs() {
    // Prefer consolidated key in weldcfg.
    prefs.begin("weldcfg", true);
    bool has_weldcfg_key = prefs.isKey("leadRmohm");
    float lead_r_mohm = prefs.getFloat("leadRmohm", UI_LEAD_R_DEFAULT_MOHM);
    prefs.end();

    if (!has_weldcfg_key) {
        // Fallback to legacy namespace used before Session 4.
        prefs.begin("spotwelder", true);
        lead_r_mohm = prefs.getFloat("lead_r_mohm", UI_LEAD_R_DEFAULT_MOHM);
        prefs.end();
    }

    lead_r_mohm = clamp_lead_r_mohm_ui(lead_r_mohm);
    lead_resistance_ohms = lead_r_mohm / 1000.0f;

