farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
    Serial.printf("[Config] Lead resistance loaded: %.3f mOhm\n",
                  (double)(lead_resistance_ohms * 1000.0f));
}

static void sendLeadResistanceToStm32(float ohms) {
    float clamped = ohms;
    if (!isfinite(clamped) || clamped < LEAD_RESISTANCE_MIN_OHMS)
        clamped = LEAD_RESISTANCE_MIN_OHMS;
    if (clamped > LEAD_RESISTANCE_MAX_OHMS) clamped = LEAD_RESISTANCE_MAX_OHMS;

    char buf[48];
    snprintf(buf, sizeof(buf), "LEAD_R,%.6f", clamped);
    forwardToStm32(String(buf));
}

static void load_recipe_from_nvs() {
    prefs.begin("weldrecipe", true);
    weld_mode = prefs.getUChar("mode", weld_mode);
    weld_d1 = prefs.getUShort("d1", weld_d1);
    weld_gap1 = prefs.getUShort("gap1", weld_gap1);
    weld_d2 = prefs.getUShort("d2", weld_d2);
    weld_gap2 = prefs.getUShort("gap2", weld_gap2);
    weld_d3 = prefs.getUShort("d3", weld_d3);
    weld_power_pct = prefs.getUChar("power", weld_power_pct);
    preheat_enabled = prefs.getBool("phEn", preheat_enabled);
    preheat_ms = prefs.getUShort("phMs", preheat_ms);
    preheat_pct = prefs.getUChar("phPct", preheat_pct);
    preheat_gap_ms = prefs.getUShort("phGap", preheat_gap_ms);
    prefs.end();
    Serial.println("[Config] Recipe loaded from NVS");
}

// ---- Weld counter persistence (survives power cycles) ----
// Stored in its own NVS namespace so it is independent of recipe/config.
static void save_weld_count_to_nvs() {
    prefs.begin("weldstats", false);
    prefs.putULong("weldCount", weld_count);
    prefs.end();
}

static void load_weld_count_from_nvs() {
    prefs.begin("weldstats", true);  // read-only
    weld_count = prefs.getULong("weldCount", 0UL);
    prefs.end();
    Serial.printf("[Weld] Counter restored from NVS: %lu\n",
                  (unsigned long)weld_count);
}

// =========================
// Phase 1: Deferred boot config – sends all NVS-loaded settings to STM32
// Called when BOOT message received OR after fallback timeout.
// Pre-flushes STM32 rx_build[] then sends paced commands (20ms inter-gap).
// =========================
static void sendBootConfig() {
    if (config_sent) return;  // idempotent guard
    config_sent = true;

    Serial.println("[Boot] Sending deferred boot config to STM32...");

    // Flush stale bytes from both sides of the UART link.
    while (STM32Serial.available()) STM32Serial.read();  // flush ESP32 RX
    delay(50);
    STM32Serial.print("\r\n");  // flush STM32 rx_build[]
    STM32Serial.flush();
    delay(50);
    Serial.println("[Boot] Flushing STM32 RX buffer");

    char buf[80];

    // SAFETY DEFAULTS ON BOOT: always start disarmed + pedal mode.
    stm_armed = false;
    trigger_mode = TRIGGER_MODE_PEDAL;
    contact_with_pedal = true;

    // 1. Recipe / pulse settings
    snprintf(buf, sizeof(buf), "SET_PULSE,%d,%d,%d,%d,%d,%d", weld_mode,
             weld_d1, weld_gap1, weld_d2, weld_gap2, weld_d3);
    forwardToStm32(String(buf));
    delay(20);

    // 2. Power
    snprintf(buf, sizeof(buf), "SET_POWER,%d", weld_power_pct);
    forwardToStm32(String(buf));
    delay(20);

    // 3. Preheat
    snprintf(buf, sizeof(buf), "SET_PREHEAT,%d,%d,%d,%d",
             preheat_enabled ? 1 : 0, preheat_ms, preheat_pct, preheat_gap_ms);
    forwardToStm32(String(buf));
    delay(20);

    // 4. Trigger mode (forced to pedal)
    forwardToStm32("SET_TRIGGER_MODE,1");
    delay(20);

    // 5. Contact hold
    snprintf(buf, sizeof(buf), "SET_CONTACT_HOLD,%d", (int)contact_hold_steps);
    forwardToStm32(String(buf));
    delay(20);

    // 6. Contact with pedal (forced enabled)
    forwardToStm32("SET_CONTACT_WITH_PEDAL,1");
    delay(20);

    // 7. Lead resistance (persisted, in ohms)
    sendLeadResistanceToStm32(lead_resistance_ohms);
    delay(20);

    // 8. Force disarmed state for safety
    forwardToStm32("ARM,0");
    delay(20);

    // 9. Kick-start STM32 status broadcasting
    forwardToStm32("READY,1");
    lastReadySentMs = millis();
    delay(20);

    // 10. Request current STM32 status
    requestStm32Status();

    config_sent_ms = millis();
    Serial.println(
        "[Boot] Config sent with safety defaults (DISARMED + PEDAL)");
}

// =========================
// Reconnect sync: re-send current recipe/settings so host UI can
// immediately re-enable ARM without requiring manual Apply.
// =========================
static void syncSettingsAfterUiReconnect() {
    if (!config_sent) {
        Serial.println(
            "[TCP] UI reconnect sync skipped (boot config not sent yet)");
        return;
    }

    // Re-validate recipe before sending to STM32.
    if (weld_mode < 1 || weld_mode > 3 || weld_d1 == 0) {
        Serial.printf(
            "[TCP] Invalid recipe for reconnect sync (mode=%u d1=%u) - "
            "skipped\n",
            (unsigned)weld_mode, (unsigned)weld_d1);
        return;
    }

    Serial.println(
        "[TCP] === Re-syncing current live settings/state (no forced defaults) "
        "===");
    Serial.printf(
        "[TCP] Sync values: mode=%u d1=%u gap1=%u d2=%u gap2=%u d3=%u power=%u "
        "preheat_en=%u preheat_ms=%u preheat_pct=%u preheat_gap=%u trigger=%u "
        "contact_hold=%u contact_pedal=%u armed=%u\n",
        (unsigned)weld_mode, (unsigned)weld_d1, (unsigned)weld_gap1,
        (unsigned)weld_d2, (unsigned)weld_gap2, (unsigned)weld_d3,
        (unsigned)weld_power_pct, (unsigned)(preheat_enabled ? 1 : 0),
        (unsigned)preheat_ms, (unsigned)preheat_pct, (unsigned)preheat_gap_ms,
        (unsigned)trigger_mode, (unsigned)contact_hold_steps,
        (unsigned)(contact_with_pedal ? 1 : 0), (unsigned)(stm_armed ? 1 : 0));

    char buf[96];

    snprintf(buf, sizeof(buf), "SET_PULSE,%u,%u,%u,%u,%u,%u",
             (unsigned)weld_mode, (unsigned)weld_d1, (unsigned)weld_gap1,
             (unsigned)weld_d2, (unsigned)weld_gap2, (unsigned)weld_d3);
    forwardToStm32(String(buf));
    delay(20);

    snprintf(buf, sizeof(buf), "SET_POWER,%u", (unsigned)weld_power_pct);
    forwardToStm32(String(buf));
    delay(20);

    snprintf(buf, sizeof(buf), "SET_PREHEAT,%u,%u,%u,%u",
             (unsigned)(preheat_enabled ? 1 : 0), (unsigned)preheat_ms,
             (unsigned)preheat_pct, (unsigned)preheat_gap_ms);
    forwardToStm32(String(buf));
    delay(20);

