farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
    snprintf(buf, sizeof(buf), "SET_TRIGGER_MODE,%u", (unsigned)trigger_mode);
    forwardToStm32(String(buf));
    delay(20);

    snprintf(buf, sizeof(buf), "SET_CONTACT_HOLD,%u",
             (unsigned)contact_hold_steps);
    forwardToStm32(String(buf));
    delay(20);

    snprintf(buf, sizeof(buf), "SET_CONTACT_WITH_PEDAL,%u",
             (unsigned)(contact_with_pedal ? 1 : 0));
    forwardToStm32(String(buf));
    delay(20);

    sendLeadResistanceToStm32(lead_resistance_ohms);
    delay(20);

    snprintf(buf, sizeof(buf), "ARM,%u", (unsigned)(stm_armed ? 1 : 0));
    forwardToStm32(String(buf));
    delay(20);

    // Ask STM32 to immediately publish fresh status after re-sync.
    requestStm32Status();

    // Mark sync optimistic; definitive state is refreshed by incoming
    // STATUS/ACK.
    stm_synced = true;
    Serial.println("[TCP] Re-sync complete (current state preserved)");
}

static void syncUiConfigFromRuntime() {
    ConfigState cfg = ui_get_config();
    bool changed = false;

    uint8_t hold_steps = contact_hold_steps;
    if (hold_steps < 1) hold_steps = 1;
    if (hold_steps > 10) hold_steps = 10;

    if (cfg.contact_hold_steps != hold_steps) {
        cfg.contact_hold_steps = hold_steps;
        changed = true;
    }

    if (cfg.contact_with_pedal != contact_with_pedal) {
        cfg.contact_with_pedal = contact_with_pedal;
        changed = true;
    }

    float lead_r_mohm = clamp_lead_r_mohm_ui(lead_resistance_ohms * 1000.0f);
    if (fabsf(cfg.lead_resistance_mohm - lead_r_mohm) > 0.0001f) {
        cfg.lead_resistance_mohm = lead_r_mohm;
        changed = true;
    }

    if (changed) {
        ui_load_config(cfg);
    }
}

// Callback from UI when config changes
static void onConfigChange(const ConfigState& cfg) {
    ConfigState normalized_cfg = cfg;
    normalized_cfg.lead_resistance_mohm =
        clamp_lead_r_mohm_ui(normalized_cfg.lead_resistance_mohm);

    apply_brightness(normalized_cfg.brightness);

    // Apply touch sensitivity to GT911 only when it actually changed (avoids
    // re-writing the controller config block on every unrelated config edit).
    static int8_t last_touch_sens = -1;  // -1 = never applied this session
    uint8_t ts = normalized_cfg.touch_sensitivity;
    if (ts < 1 || ts > 10) ts = 5;
    if ((int8_t)ts != last_touch_sens) {
        if (applyTouchSensitivity(ts)) last_touch_sens = (int8_t)ts;
    }

    // Sync contact_hold_steps from ConfigState to main.cpp global and STM32
    if (normalized_cfg.contact_hold_steps != contact_hold_steps) {
        contact_hold_steps = normalized_cfg.contact_hold_steps;
        char buf[40];
        snprintf(buf, sizeof(buf), "SET_CONTACT_HOLD,%d",
                 (int)contact_hold_steps);
        processCommand(String(buf));
    }

    float target_lead_ohm = normalized_cfg.lead_resistance_mohm / 1000.0f;
    if (fabsf(target_lead_ohm - lead_resistance_ohms) > 0.000001f) {
        char buf[48];
        snprintf(buf, sizeof(buf), "SET_LEAD_R,%.3f",
                 (double)normalized_cfg.lead_resistance_mohm);
        processCommand(String(buf));
    }

    save_config_to_nvs(normalized_cfg);
}

// Callback from UI when trigger source changes (Status tab buttons)
static void onTriggerSourceChange(uint8_t mode) {
    char buf[40];
    snprintf(buf, sizeof(buf), "SET_TRIGGER_MODE,%d", (int)mode);
    processCommand(String(buf));

    ConfigState cfg = load_config_from_nvs();
    save_config_to_nvs(cfg);

    Serial.printf("[Trigger] Mode changed to %s via touch UI\n",
                  mode == 1 ? "Pedal" : "Probe");
}

// Callback from UI when weld counter is tapped (reset)
static void onWeldCountReset() {
    processCommand("RESET_WELD_COUNT");
    Serial.println("[Weld] Counter reset via touch UI");
}

// Callback from UI when contact-with-pedal toggle changes
static void onContactWithPedalChange(bool enabled) {
    char buf[40];
    snprintf(buf, sizeof(buf), "SET_CONTACT_WITH_PEDAL,%d", enabled ? 1 : 0);

    processCommand(String(buf));

    ConfigState cfg = load_config_from_nvs();
    cfg.contact_with_pedal = enabled;
    save_config_to_nvs(cfg);

    Serial.printf("[Config] Contact-with-pedal set to %s via touch UI\n",
                  enabled ? "ON" : "OFF");
}

// Callback from UI (CONFIG tab) when AUTO CALIBRATE is pressed.
// Triggers the STM32 lead-resistance auto-calibration routine.
static void onCalibrate() {
    processCommand("CAL_LEAD_START");
    Serial.println("[Cal] Lead-resistance auto-calibration started via touch UI");
}

// Callback from UI (JOULE tab) when APPLY is pressed.
//   mode_joule = true -> JOULE control mode, false -> TIME control mode
//   target_j   = target energy (J), max_ms = max-duration safety limit (ms)
static void onJouleApply(bool mode_joule, float target_j, uint16_t max_ms) {
    char buf[48];

    // 1) Control mode (SET_MODE,<0=time|1=joule>)
    snprintf(buf, sizeof(buf), "SET_MODE,%d", mode_joule ? 1 : 0);
    processCommand(String(buf));
    control_mode = mode_joule ? 1 : 0;

    // 2) Target energy
    snprintf(buf, sizeof(buf), "SET_JOULE_TARGET,%.1f", (double)target_j);
    processCommand(String(buf));
    joule_target_j = target_j;

    // 3) Max-duration safety limit
    snprintf(buf, sizeof(buf), "SET_JOULE_MAX,%u", (unsigned)max_ms);
    processCommand(String(buf));
    joule_max_ms = max_ms;

    // Push an immediate STATUS so the Flask dashboard reflects the new control
    // mode right away instead of waiting for the next periodic STATUS tick.
    sendToPi(buildStatus());

    Serial.printf("[Joule] Applied mode=%s target=%.1fJ max=%ums via touch UI\n",
                  mode_joule ? "JOULE" : "TIME", (double)target_j,
                  (unsigned)max_ms);
}

// Callback from UI (CONFIG tab) when contact delay steps change.
// SET_CONTACT_HOLD is already forwarded by onConfigChange (driven by the same
// stepper), so this only logs to avoid a duplicate command / flash write.
static void onContactDelayChange(uint8_t steps) {
    Serial.printf("[Config] Contact delay set to %d step(s) via touch UI\n",
                  (int)steps);
}

// =========================
// Setup-tab maintenance callbacks
// =========================

// "Reconfigure WiFi": tear down the current STA connection and bring up the
// AP captive portal + QR code so the user can join a different network.
static void onWifiReconfigure() {
    Serial.println("[WiFi] Reconfigure requested from Setup tab");
    startApPortal();
}

// "Restart": simply reboot the ESP32. Saved WiFi creds are retained in NVS,
// so the device will reconnect normally on the next boot.
static void onDeviceRestart() {
    Serial.println("[Maint] Restart requested from Setup tab - rebooting...");
    delay(200);
    ESP.restart();
}

// "Factory Reset": wipe every NVS namespace this firmware uses (WiFi creds,
// recipes, config, stats) and reboot. The device will come up in AP/portal
// mode because the WiFi creds are gone.
static void onFactoryReset() {
    Serial.println("[Maint] FACTORY RESET requested - clearing all NVS...");
    Preferences p;
    const char* namespaces[] = {"wificfg", "weldcfg", "weldrecipe",
                                "spotwelder", "weldstats"};
    for (const char* ns : namespaces) {
        if (p.begin(ns, false)) {
            p.clear();
            p.end();
            Serial.printf("[Maint]   cleared NVS namespace '%s'\n", ns);
        }
    }
    Serial.println("[Maint] Factory reset complete - rebooting...");
    delay(300);
    ESP.restart();
}

