farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
// ===========================================================================
// DUAL FIRMWARE UPDATE  —  microSD card  ->  ESP32 (self-flash) & STM32G474
// ---------------------------------------------------------------------------
// Two independent flows, both driven from the CONFIG-tab "Firmware Update"
// buttons:
//
//   1) updateESP32FromSD()  reads /esp32_firmware.bin and re-flashes THIS
//      ESP32 with the Arduino Update.h API (same mechanism as OTA, using the
//      spare OTA partition -> safe rollback). The RGB panel is HARD-BLANKED for
//      the write because each flash erase/program disables the SPI-flash cache
//      (the documented "color-loop" hazard); progress is reported over serial,
//      and the device reboots into the new image on success.
//
//   2) flashSTM32FromSD()   reads /stm32_firmware.bin and programs the STM32
//      over the GPIO17/18 UART link using the ST ROM bootloader protocol
//      (AN3155). Bootloader entry is SOFTWARE-only: the ESP32 sends a
//      "BOOTLOADER" command and the STM32 application jumps to system memory
//      itself (no BOOT0/NRST wires). The new app is launched with the AN3155
//      "Go" command. Because the ESP32's own flash/PSRAM are untouched here,
//      the panel stays ON and shows a live progress bar, and touch keeps
//      working throughout. The ESP32 reboots afterwards only to cleanly
//      relaunch the STM32 application data link.
//
// Both flows are REQUESTED from the LVGL button callback (which only sets a
// flag) and EXECUTED from loop(), never from inside the LVGL event dispatch —
// this avoids re-entrancy and keeps the long blocking transfer out of the
// widget event path.
// ===========================================================================

// ---- SD card on a dedicated SPI bus (does not touch the display/UART pins) --
static SPIClass g_sdSPI(HSPI);
static bool g_sd_mounted = false;

// Mount the microSD card once (idempotent). Returns true if a card is present
// and the FAT filesystem mounted.
static bool sdEnsureMounted() {
    if (g_sd_mounted) return true;
    g_sdSPI.begin(TF_SPI_SCLK, TF_SPI_MISO, TF_SPI_MOSI, TF_CS);
    // 20 MHz is a conservative, reliable rate for the on-board slot.
    if (SD.begin(TF_CS, g_sdSPI, 20000000)) {
        g_sd_mounted = true;
        Serial.printf("[SD] mounted (type=%u, size=%lluMB)\n",
                      (unsigned)SD.cardType(),
                      (unsigned long long)(SD.cardSize() / (1024ULL * 1024ULL)));
        return true;
    }
    Serial.println("[SD] mount FAILED (no card inserted or wiring issue)");
    return false;
}

// True if `path` exists on the SD card with a non-zero size; size returned via
// out_size when provided.
static bool sdFileExists(const char* path, size_t* out_size) {
    if (!sdEnsureMounted()) return false;
    File f = SD.open(path, FILE_READ);
    if (!f) return false;
    size_t sz = f.size();
    f.close();
    if (out_size) *out_size = sz;
    return sz > 0;
}

// Deferred firmware-update request (set from the UI callback, run in loop()).
enum { FW_REQ_NONE = 0, FW_REQ_ESP32 = 1, FW_REQ_STM32 = 2 };
static volatile uint8_t g_fw_request = FW_REQ_NONE;

// ===========================================================================
// FLOW 1 — ESP32 self-flash from SD (Update.h)
// ===========================================================================
// Inner worker: flashes THIS ESP32 from /esp32_firmware.bin on the SD card.
// Returns true on success (new image written & verified, ready to run on the
// next boot). Fills 'msg' with a short human-readable result in both cases.
// Does NOT reboot and does NOT show the popup - the thin wrapper
// updateESP32FromSD() owns the completion popup and the reboot.
static bool esp32FlashFromSD(char* msg, size_t msgn) {
    show_firmware_progress("ESP32", 0, "Checking SD card...");

    size_t fw_size = 0;
    if (!sdFileExists(SD_ESP32_FW_PATH, &fw_size)) {
        snprintf(msg, msgn, "%s not found on SD card", SD_ESP32_FW_PATH);
        return false;
    }
    // Sanity: a real app image is at least a few KB and fits in the 16MB flash.
    if (fw_size < 4096 || fw_size > (4u * 1024u * 1024u)) {
        snprintf(msg, msgn, "ESP32 image size out of range");
        return false;
    }

    File f = SD.open(SD_ESP32_FW_PATH, FILE_READ);
    if (!f) {
        snprintf(msg, msgn, "Cannot open ESP32 image");
        return false;
    }
    // Header sanity: every ESP32 application image starts with magic byte 0xE9.
    if (f.peek() != 0xE9) {
        f.close();
        snprintf(msg, msgn, "Not a valid ESP32 image (magic != 0xE9)");
        return false;
    }

    if (!Update.begin(fw_size)) {
        f.close();
        snprintf(msg, msgn, "Update.begin failed (%s)", Update.errorString());
        return false;
    }

    ota_last_drawn_pct = -1;  // reset throttle for this transfer
    show_firmware_progress("ESP32", 0, "Writing firmware - do NOT power off!");
    delay(600);  // give the operator time to read the warning

    // Live progress during the write. With XIP-from-PSRAM the panel keeps
    // running while flash is programmed, so the bar updates in real time (no
    // more hard-blanking the screen). THROTTLE the repaint to >= 2% steps: each
    // repaint is a full-frame PSRAM->LCD flush that competes with the flash
    // writes, so painting every chunk would massively slow the update.
    Update.onProgress([](size_t done, size_t total) {
        int pct = total ? (int)((done * 100ULL) / total) : 0;
        Serial.printf("[SD->ESP32] %d%%\r", pct);
        if (pct >= ota_last_drawn_pct + 2 || pct >= 100) {
            ota_last_drawn_pct = pct;
            show_firmware_progress("ESP32", pct, "Writing firmware...");
        }
    });

    size_t written = Update.writeStream(f);
    f.close();

    if (written != fw_size || !Update.end(true)) {
        snprintf(msg, msgn, "ESP32 flash failed (%s)", Update.errorString());
        return false;
    }

