farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
    Serial.println("\n[SD->ESP32] flash OK");
    snprintf(msg, msgn, "ESP32 firmware updated successfully. Restarting...");
    return true;
}

// Public entry (latched from the Setup-tab "UPDATE ESP32" button). Runs the
// flash, shows the modal completion popup, and reboots into the new image on
// success.
static bool updateESP32FromSD() {
    ota_in_progress = true;  // gate normal loop() work (UI/UART/TCP)
    char msg[128] = {0};
    bool ok = esp32FlashFromSD(msg, sizeof(msg));

    if (ok) {
        // Success reboots into the new image. Show 100% briefly, then stash the
        // result and let the freshly-booted firmware show the completion popup
        // once the display has settled (see the boot-popup logic in loop()).
        show_firmware_progress("ESP32", 100, "Update complete - restarting...");
        armBootFirmwarePopup(true, "ESP32", msg);
        delay(200);
        ESP.restart();  // never returns
    }
    // Failure path stays in the running app (no reboot): tear down the progress
    // modal and show the result popup right away so the operator can read the
    // error and retry. This is normal operation, so it is NOT deferred.
    hide_firmware_progress();
    show_firmware_result_popup(false, msg, "ESP32");
    ota_in_progress = false;
    return ok;
}

// ===========================================================================
// FLOW 2 — STM32 flash from SD over the ST ROM bootloader (AN3155)
// ===========================================================================

// --- AN3155 / bootloader constants ---
static const uint8_t STM_ACK = 0x79;
static const uint8_t STM_NACK = 0x1F;
static const uint8_t STM_INIT = 0x7F;
#define STM32_FLASH_BASE 0x08000000UL

// Read one byte with timeout (ms). Returns -1 on timeout.
// NOTE on IRAM_ATTR (applies to every AN3155 helper below + stm32FlashFromSD):
// the build runs code from PSRAM (CONFIG_SPIRAM_XIP_FROM_PSRAM). PSRAM fetches
// are slower and can stall under bus contention, which delayed the UART2 RX path
// enough to drop the timing-sensitive STM32 ROM-bootloader ACK bytes (handshake
// failed -> "bootloader did not respond" / mid-write errors). Forcing these
// functions into fast internal IRAM removes that PSRAM-fetch jitter so the
// handshake and writes are reliable again.
static IRAM_ATTR int stmReadByte(uint32_t timeout_ms) {
    uint32_t t0 = millis();
    while (!STM32Serial.available()) {
        if (millis() - t0 > timeout_ms) return -1;
        yield();
    }
    return STM32Serial.read();
}

// Wait for an ACK (0x79). Logs NACK/timeout/unexpected bytes for diagnostics.
static IRAM_ATTR bool stmWaitAck(uint32_t timeout_ms) {
    int b = stmReadByte(timeout_ms);
    if (b == STM_ACK) return true;
    if (b == STM_NACK)
        Serial.println("[STM] NACK");
    else if (b < 0)
        Serial.println("[STM] timeout waiting for ACK");
    else
        Serial.printf("[STM] unexpected byte 0x%02X\n", b);
    return false;
}

static IRAM_ATTR void stmDrainRx() {
    while (STM32Serial.available()) STM32Serial.read();
}

// Send command byte + its complement, wait for ACK.
static IRAM_ATTR bool stmSendCmd(uint8_t cmd) {
    STM32Serial.write(cmd);
    STM32Serial.write((uint8_t)(cmd ^ 0xFF));
    STM32Serial.flush();
    return stmWaitAck(800);
}

// Bootloader auto-baud handshake: send 0x7F until the device answers.
static IRAM_ATTR bool stmSync() {
    for (int i = 0; i < 8; i++) {
        stmDrainRx();
        STM32Serial.write(STM_INIT);
        STM32Serial.flush();
        int b = stmReadByte(500);
        if (b == STM_ACK) {
            Serial.println("[STM] sync OK (ACK)");
            return true;
        }
        if (b == STM_NACK) {
            // Already initialised this power cycle -> treat as connected.
            Serial.println("[STM] sync OK (NACK = already initialised)");
            return true;
        }
        delay(50);
    }
    return false;
}

// Get ID command (0x02) -> 12-bit product ID (G474 = 0x469).
static IRAM_ATTR bool stmGetId(uint16_t* id) {
    if (!stmSendCmd(0x02)) return false;
    int n = stmReadByte(500);  // number-of-bytes-minus-1 (=1 for a 2-byte ID)
    if (n < 0) return false;
    int hi = stmReadByte(500);
    int lo = stmReadByte(500);
    if (hi < 0 || lo < 0) return false;
    if (!stmWaitAck(500)) return false;
    if (id) *id = (uint16_t)(((hi & 0xFF) << 8) | (lo & 0xFF));
    return true;
}

// Extended Erase (0x44) global mass-erase (special code 0xFFFF, checksum 0x00).
static IRAM_ATTR bool stmMassErase() {
    if (!stmSendCmd(0x44)) return false;
    STM32Serial.write((uint8_t)0xFF);
    STM32Serial.write((uint8_t)0xFF);
    STM32Serial.write((uint8_t)0x00);  // checksum = 0xFF ^ 0xFF
    STM32Serial.flush();
    return stmWaitAck(30000);  // a full mass erase can take several seconds
}

// Write Memory (0x31): up to 256 bytes (len = 1..256) at `addr`.
static IRAM_ATTR bool stmWriteChunk(uint32_t addr, const uint8_t* data, int len) {
    if (len < 1 || len > 256) return false;
    if (!stmSendCmd(0x31)) return false;
    uint8_t a[4] = {(uint8_t)(addr >> 24), (uint8_t)(addr >> 16),
                    (uint8_t)(addr >> 8), (uint8_t)addr};
    uint8_t acs = a[0] ^ a[1] ^ a[2] ^ a[3];
    STM32Serial.write(a, 4);
    STM32Serial.write(acs);
    STM32Serial.flush();
    if (!stmWaitAck(800)) return false;

    uint8_t n = (uint8_t)(len - 1);  // device expects (count - 1)
    uint8_t cs = n;
    for (int i = 0; i < len; i++) cs ^= data[i];
    STM32Serial.write(n);
    STM32Serial.write(data, len);
    STM32Serial.write(cs);
    STM32Serial.flush();
    return stmWaitAck(2000);
}

// Go (0x21): jump to and run the application at `addr`. In the software-
// bootloader flow this is how the freshly written STM32 application is launched
// (there is no NRST line to pulse), so it is called at the end of a flash.
static IRAM_ATTR bool stmGo(uint32_t addr) {
    if (!stmSendCmd(0x21)) return false;
    uint8_t a[4] = {(uint8_t)(addr >> 24), (uint8_t)(addr >> 16),
                    (uint8_t)(addr >> 8), (uint8_t)addr};
    uint8_t cs = a[0] ^ a[1] ^ a[2] ^ a[3];
    STM32Serial.write(a, 4);
    STM32Serial.write(cs);
    STM32Serial.flush();
    return stmWaitAck(1000);
}

// Software jump-to-bootloader: ask the running STM32 application to reboot into
// its built-in ROM bootloader. Sent over the NORMAL application link (2 Mbaud,
// 8N1) BEFORE we switch the ESP32 UART to bootloader settings. The STM32
// firmware must implement a matching handler that, on receiving this line,
// calls its jump-to-system-memory routine (see the notes returned to the user).
// There is no hardware BOOT0/NRST line, so this command is the only way in.
static IRAM_ATTR void sendBootloaderCommand() {
    STM32Serial.print("BOOTLOADER");
    STM32Serial.print("\r\n");
    STM32Serial.flush();
}

