farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
// Restore the normal 2 Mbaud 8N1 application link to the STM32.
static IRAM_ATTR void stm32RestoreAppLink() {
    STM32Serial.end();
    STM32Serial.setRxBufferSize(8192);
    STM32Serial.begin(2000000, SERIAL_8N1, STM32_TO_ESP32_PIN,
                      ESP32_TO_STM32_PIN);
}

// Inner worker: flashes the STM32 from /stm32_firmware.bin over the AN3155 ROM
// bootloader. Returns true on success and fills 'msg' with a short result in
// both cases. Does NOT reboot and does NOT show the popup - the thin wrapper
// flashSTM32FromSD() owns the completion popup and the (always-performed)
// reboot.
static bool stm32FlashFromSD(char* msg, size_t msgn) {
    // -- Pre-flight checks (display still ON; these are fast and may fail) -----
    size_t fw_size = 0;
    if (!sdFileExists(SD_STM32_FW_PATH, &fw_size)) {
        snprintf(msg, msgn, "%s not found on SD card", SD_STM32_FW_PATH);
        return false;
    }
    // STM32G474CE has 512 KB flash; sanity-check the image fits.
    if (fw_size < 256 || fw_size > (512u * 1024u)) {
        snprintf(msg, msgn, "STM32 image size out of range");
        return false;
    }

    File f = SD.open(SD_STM32_FW_PATH, FILE_READ);
    if (!f) {
        snprintf(msg, msgn, "Cannot open STM32 image");
        return false;
    }

    // ------------------------------------------------------------------------
    // Timing-safe flash with a live progress bar (the IRAM_ATTR approach)
    // ------------------------------------------------------------------------
    // Root cause of the earlier instability was NOT the display - it was that
    // with XIP-from-PSRAM enabled the AN3155 handshake helpers executed from
    // (slow, bus-contended) PSRAM, which delayed the UART2 RX servicing enough
    // to drop the timing-sensitive STM32 bootloader ACK (0x79) bytes. The fix
    // is to pin all of those helpers in fast internal RAM with IRAM_ATTR (done
    // above), so the protocol meets timing even while the panel keeps scanning
    // out of PSRAM. That lets us keep the display ON and show a real progress
    // bar again. We still disable WiFi for the duration of the flash to remove
    // its (bursty) bus/IRQ contention, and reconnect afterwards.
    bool wifi_was_connected = (WiFi.status() == WL_CONNECTED);
    WiFi.disconnect(true);
    WiFi.mode(WIFI_OFF);
    delay(100);

    show_firmware_progress("STM32", 0, "Entering bootloader...");

    // --- Ask the STM32 app to jump to its ROM bootloader (software trigger) --
    // Send the command over the CURRENT application link (2 Mbaud, 8N1) while it
    // is still open, then give the STM32 time to reboot into system memory
    // before we switch the ESP32 UART to AN3155 bootloader settings.
    sendBootloaderCommand();
    delay(100);  // STM32 resets into the ROM bootloader
    STM32Serial.end();
    // ST ROM bootloader: 8 data bits, EVEN parity, 1 stop; auto-baud from 0x7F.
    STM32Serial.begin(115200, SERIAL_8E1, STM32_TO_ESP32_PIN,
                      ESP32_TO_STM32_PIN);
    delay(20);

    bool ok = false;
    const char* err = nullptr;
    do {
        if (!stmSync()) {
            err = "STM32 bootloader did not respond";
            break;
        }
        uint16_t id = 0;
        if (stmGetId(&id))
            Serial.printf("[STM] product ID = 0x%03X%s\n", id,
                          (id == 0x469) ? " (G474 OK)" : "");

        show_firmware_progress("STM32", 5, "Erasing...");
        if (!stmMassErase()) {
            err = "STM32 mass-erase failed";
            break;
        }

        // -------------------------------------------------------------------
        // WRITE LOOP (display stays ON; IRAM-pinned helpers keep timing safe)
        // -------------------------------------------------------------------
        // 256-byte chunks with a watchdog feed + yield() between writes. The
        // progress modal is repainted in ~10% steps so the UI stays responsive
        // without flooding LVGL with a refresh on every single chunk.
        show_firmware_progress("STM32", 10, "Writing...");
        uint32_t addr = STM32_FLASH_BASE;
        size_t done = 0;
        uint8_t buf[256];
        bool werr = false;
        bool readErr = false;
        int last_drawn_pct = 10;
        while (done < fw_size) {
            size_t remain = fw_size - done;
            int want = (remain > sizeof(buf)) ? (int)sizeof(buf) : (int)remain;
            int r = f.read(buf, want);
            if (r <= 0) {
                // SD read failed/short before EOF -> real error, not success.
                readErr = true;
                break;
            }
            // Pad the final partial word up to a 4-byte boundary with 0xFF.
            while (r % 4) buf[r++] = 0xFF;
            if (!stmWriteChunk(addr, buf, r)) {
                werr = true;
                break;
            }
            addr += r;
            done += r;
            // Map write progress into the 10..95% band of the bar.
            int pct = 10 + (int)((done * 85) / fw_size);
            if (pct > 95) pct = 95;
            if (pct >= last_drawn_pct + 10 || done >= fw_size) {
                last_drawn_pct = pct;
                show_firmware_progress("STM32", pct, "Writing...");
            }
            esp_task_wdt_reset();  // cheap WDT feed (no-op if not subscribed)
            yield();               // let other FreeRTOS tasks run
        }
        if (readErr) {
            err = "SD card read error during STM32 write";
            break;
        }
        if (werr) {
            err = "STM32 write failed";
            break;
        }
        if (done < fw_size) {
            err = "STM32 write incomplete";
            break;
        }
        ok = true;
    } while (0);

    f.close();

    if (ok) show_firmware_progress("STM32", 98, "Launching...");

    // Launch the freshly written application with the AN3155 "Go" command
    // (there is no NRST line to pulse in the software-bootloader approach),
    // then restore the normal 2 Mbaud 8N1 application link settings.
    if (ok) stmGo(STM32_FLASH_BASE);  // jump to the new app at 0x08000000
    stm32RestoreAppLink();

    // Reconnect WiFi if it was up before the flash (the wrapper reboots the
    // ESP32 shortly after, but restore the radio so nothing is left disabled
    // if that path ever changes).
    if (wifi_was_connected && wifi_ssid.length() > 0) {
        startStaConnect();
    }

    snprintf(msg, msgn, "%s",
             ok ? "STM32 firmware updated successfully. Restarting..."
                : (err ? err : "STM32 update failed"));
    return ok;
}

