farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
// Public entry (latched from the Setup-tab "UPDATE STM32" button). Runs the
// flash, shows the modal completion popup, then reboots the ESP32 so both sides
// start from a clean, re-synced application link.
static bool flashSTM32FromSD() {
    ota_in_progress = true;
    char msg[128] = {0};
    bool ok = stm32FlashFromSD(msg, sizeof(msg));

    // Touch (GPIO19/20) was never disturbed, but the STM32 link was reopened at
    // bootloader settings and the STM32 just rebooted into the (new) app. We
    // always reboot the ESP32 so both sides start from a clean, re-synced link.
    show_firmware_progress("STM32", 100,
                           ok ? "Update complete - restarting..."
                              : "Update failed - restarting...");

    // The STM32 flow always reboots the ESP32 (to re-sync the app link). The
    // result popup is currently DISABLED (see setup()) while we debug the flash
    // itself, so just log the outcome to the UART instead of arming a deferred
    // popup. (Re-enable by restoring armBootFirmwarePopup(ok, "STM32", msg).)
    Serial.printf("[STM32] flash %s: %s\n", ok ? "OK" : "FAIL", msg);
    delay(200);
    ESP.restart();  // never returns; relaunches clean app link on boot
    return ok;
}

// ---- UI button callbacks: only LATCH a request; loop() runs the transfer ----
static void onUpdateEsp32FromSD() { g_fw_request = FW_REQ_ESP32; }
static void onUpdateStm32FromSD() { g_fw_request = FW_REQ_STM32; }

// =========================
// Setup
// =========================
void setup() {
    Serial.begin(115200);
    delay(500);

    Serial.println();
    Serial.println("===========================================");
    Serial.println("ESP32 Spot Welder Controller Boot Sequence");
    Serial.println("===========================================");
    Serial.println("[Boot] 1/4 Initializing firmware...");

    // ==========================================================
    // FIRMWARE RESULT POPUP DISABLED (run FIRST, before any init)
    // ----------------------------------------------------------
    // The deferred firmware-update result popup is temporarily disabled while
    // we debug the STM32 flash itself (progress + result are visible on the
    // UART log). The post-flash popup was also able to wedge the device in a
    // boot loop: a stuck FAIL flag in RTC memory survived the reboot and was
    // re-detected every boot, and a crash before it could be consumed meant it
    // never cleared. To guarantee a clean boot we UNCONDITIONALLY wipe every
    // RTC firmware-result flag here, at the very top of setup(), before any
    // crash-prone display/WiFi/STM32 init runs. Nothing downstream will latch
    // or show a popup. (Re-enable later by restoring the latch logic.)
    if (rtc_fw_popup_magic == FW_BOOT_POPUP_MAGIC) {
        Serial.println("[Boot] Cleared pending firmware result flag "
                       "(popup disabled)");
    }
    rtc_fw_popup_magic = 0;
    rtc_fw_popup_success = false;
    rtc_fw_popup_device[0] = '\0';
    rtc_fw_popup_msg[0] = '\0';
    boot_fw_popup_pending = false;

    // --- UART to STM32 ---
    STM32Serial.setRxBufferSize(
        8192);  // LAMBO buffer for large waveform bursts
    STM32Serial.begin(2000000, SERIAL_8N1, STM32_TO_ESP32_PIN,
                      ESP32_TO_STM32_PIN);
    Serial.println("✅ STM32 UART bridge ready (Serial2 @ 2000000)");

    // --- Front button ---
    pinMode(BUTTON_PIN, INPUT_PULLUP);

    // ==========================================================
    // DISPLAY + TOUCH INIT
    // smartdisplay_init() claims I2C_NUM_0 for GT911 at 400kHz
    // DO NOT call Wire.begin() after this – it conflicts!
    // ==========================================================
    Serial.println("Initializing display (smartdisplay)...");
    smartdisplay_init();  // creates the RGB panel + framebuffer and runs lv_init()

    // BOOT STABILIZATION: keep the backlight OFF, then clear the (uninitialised,
    // garbage-filled) PSRAM framebuffer and re-align the scan-out DMA BEFORE any
    // UI is created. This kills the garbled/overlapping/shifted first frame seen
    // on a cold boot (see displayBootStabilize() for the full root-cause notes).
    // The backlight is turned back on further below, only after LVGL has drawn
    // the real UI into the now-clean framebuffer, so the operator never sees the
    // power-on garbage.
    smartdisplay_lcd_set_backlight(0.0f);
    displayBootStabilize();
    Serial.println("✅ Display initialized (framebuffer cleared, DMA synced)");

    // ==========================================================
    // TOUCH INDEV OVERRIDE – wrap smartdisplay driver with filter
    // ==========================================================
    lv_indev_t* indev = lv_indev_get_next(nullptr);
    bool found_touch = false;

    while (indev != nullptr) {
        if (lv_indev_get_type(indev) == LV_INDEV_TYPE_POINTER) {
            Serial.println(
                "✅ Touch indev found – wrapping with debounce filter");
            original_read_cb = indev->read_cb;
            indev->read_cb = debounced_touchpad_read;
            found_touch = true;
            break;
        }
        indev = lv_indev_get_next(indev);
    }

    if (!found_touch) {
        Serial.println("⚠️ No touch indev found from smartdisplay!");
    }

    // ==========================================================
    // LVGL UI
    // ==========================================================
    ui_init(onArmToggle, onRecipeApply);
    Serial.println("✅ UI created (5-tab shell + Pulse tab)");

    // Render the real UI into the (already-cleared) framebuffer, then turn the
    // backlight back on. The backlight is still OFF here, so everything below
    // happens off-screen. We render TWICE with a settle delay in between:
    //
    //   * First render: draws the freshly-created widgets into the framebuffer.
    //   * 150 ms settle (was 50 ms): gives the just-restarted scan-out DMA
    //     several full panel frames (~29 Hz => ~35 ms/frame) to lock onto the
    //     clean buffer before anything is shown. The longer delay is what fixes
    //     the *intermittent* corruption — 50 ms was sometimes too short for the
    //     DMA to fully re-align on a cold boot.
    //   * Second render: repaints the whole UI over the now-settled, correctly
    //     aligned scan-out, guaranteeing the first visible frame is clean even
    //     if the first render raced an in-flight re-alignment.
    //
    // Only after both renders is the backlight enabled, so the operator never
    // sees the power-on garbage, a half-drawn frame, or a shifted/rotated UI.
    lv_timer_handler();        // let LVGL process the freshly-created widgets
    lv_refr_now(NULL);         // first synchronous full-frame flush to the panel
    delay(150);                // settle: let the re-aligned DMA lock on (was 50)
    lv_refr_now(NULL);         // second flush over the now-stable scan-out
    smartdisplay_lcd_set_backlight(1.0f);
    Serial.println("✅ Backlight on (UI dual-rendered into clean framebuffer)");

    // --- Config: Load settings from NVS into memory (Phase 1: NO STM32 sends
    // here) ---
    {
        ConfigState cfg = load_config_from_nvs();

        // Apply brightness immediately (local display only, not STM32)
        apply_brightness(cfg.brightness);

        // Apply touch sensitivity to the GT911 (controller already initialised
        // by smartdisplay_init above, so its config block is writable now).
        applyTouchSensitivity(cfg.touch_sensitivity);

        // Restore recipe from NVS if enabled – into globals only, NOT sent to
        // STM32
        if (cfg.load_last_on_boot) {
            load_recipe_from_nvs();
            Serial.println(
                "[Config] Load-last-on-boot: recipe loaded to memory (deferred "
                "send)");
        }

        // Sync globals from loaded config (no STM32 commands)
        // Force safety-critical defaults regardless of NVS
        // (user can change after boot, but we always start safe)
        stm_armed = false;                  // DISARMED
        trigger_mode = TRIGGER_MODE_PEDAL;  // MANUAL/PEDAL
        contact_with_pedal = true;          // require pedal gating
        load_lead_resistance_from_nvs();
        load_weld_count_from_nvs();  // restore lifetime weld counter

        // Push loaded config to UI widgets (display-side only)
        ui_set_config_cb(onConfigChange);
        ui_load_config(cfg);
        Serial.println(
            "✅ Config loaded into memory (STM32 send deferred to "
            "boot/timeout)");
    }

    // --- Safety defaults (always on ESP32 reboot) ---
    Serial.println("[Boot] 2/4 Applying safety defaults...");
    stm_armed = false;  // always boot disarmed
    stm_synced = false;
    trigger_mode = TRIGGER_MODE_PEDAL;  // always boot in pedal mode
    contact_with_pedal = true;          // pedal gating enabled

