farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
    Serial.println("[Boot] Safety defaults applied:");
    Serial.println("       - Armed: false");
    Serial.println("       - Trigger mode: PEDAL");
    Serial.println("       - Contact with pedal: enabled");
    Serial.printf(
        "[Boot] Persistent recipe retained: mode=%u d1=%u gap1=%u d2=%u "
        "gap2=%u d3=%u power=%u preheat_en=%u preheat_ms=%u preheat_pct=%u "
        "preheat_gap=%u\n",
        (unsigned)weld_mode, (unsigned)weld_d1, (unsigned)weld_gap1,
        (unsigned)weld_d2, (unsigned)weld_gap2, (unsigned)weld_d3,
        (unsigned)weld_power_pct, (unsigned)(preheat_enabled ? 1 : 0),
        (unsigned)preheat_ms, (unsigned)preheat_pct, (unsigned)preheat_gap_ms);

    // --- Register remaining UI callbacks ---
    ui_set_trigger_source_cb(onTriggerSourceChange);
    ui_set_weld_count_reset_cb(onWeldCountReset);
    ui_set_contact_with_pedal_cb(onContactWithPedalChange);

    // --- New dashboard / Joule / Calibration callbacks ---
    ui_set_calibrate_cb(onCalibrate);
    ui_set_joule_apply_cb(onJouleApply);
    ui_set_contact_delay_cb(onContactDelayChange);

    // --- Setup-tab (WiFi provisioning / maintenance) callbacks ---
    ui_set_wifi_reconfigure_cb(onWifiReconfigure);
    ui_set_restart_cb(onDeviceRestart);
    ui_set_factory_reset_cb(onFactoryReset);

    // --- Firmware-update (SD card) callbacks ---
    ui_set_fw_update_esp32_cb(onUpdateEsp32FromSD);
    ui_set_fw_update_stm32_cb(onUpdateStm32FromSD);
    Serial.println("[Boot] UI callbacks registered");

    // --- microSD card (firmware-update source) ---
    if (sdEnsureMounted()) {
        size_t sz = 0;
        Serial.printf("[SD] esp32_firmware.bin present: %s\n",
                      sdFileExists(SD_ESP32_FW_PATH, &sz) ? "yes" : "no");
        Serial.printf("[SD] stm32_firmware.bin present: %s\n",
                      sdFileExists(SD_STM32_FW_PATH, &sz) ? "yes" : "no");
    }

    // --- Populate static System Info on the Setup tab ---
    ui_set_system_info(FW_VERSION, ESP.getChipModel(),
                       (uint32_t)ESP.getFlashChipSize(),
                       (uint32_t)weld_count);

    // ==========================================================
    // WiFi provisioning (non-blocking, cooperative with LVGL)
    //   - Loads creds from NVS and connects (STA), OR
    //   - Starts the AP captive portal + QR code if no creds.
    // ==========================================================
    Serial.println("[Boot] 4/4 Starting WiFi provisioning + TCP services...");
    beginWifiProvisioning();

    // Pick up a firmware-update result stashed before the last warm reboot.
    // We only LATCH it here (and immediately consume the RTC flag so it can
    // never show twice); the popup itself is shown later from loop(), once the
    // display has fully settled. The magic check rejects the uninitialised RTC
    // garbage seen on a true cold power-on.
    if (rtc_fw_popup_magic == FW_BOOT_POPUP_MAGIC) {
        boot_fw_popup_pending = true;
        boot_fw_popup_success = rtc_fw_popup_success;
        snprintf(boot_fw_popup_device, sizeof(boot_fw_popup_device), "%s",
                 rtc_fw_popup_device);
        snprintf(boot_fw_popup_msg, sizeof(boot_fw_popup_msg), "%s",
                 rtc_fw_popup_msg);
        rtc_fw_popup_magic = 0;  // consume: one-shot
        Serial.printf("[Boot] Deferred firmware popup pending (%s, %s)\n",
                      boot_fw_popup_device,
                      boot_fw_popup_success ? "OK" : "FAIL");
    }

    setup_done_ms = millis();
    Serial.println(
        "[Boot] Boot complete - waiting for STM32 BOOT/fallback sync");
    Serial.println("===========================================");
}

// Loop
// =========================
static unsigned long lv_last_tick = 0;

void loop() {
    // --- LVGL tick (must run before any early-return so timing stays sane) ---
    unsigned long now_ms = millis();
    lv_tick_inc(now_ms - lv_last_tick);
    lv_last_tick = now_ms;

    // --- Service OTA FIRST ---------------------------------------------------
    // ArduinoOTA.handle() is cheap when idle. When a transfer starts it BLOCKS
    // here for the whole download, driving the progress overlay from its own
    // (throttled) callbacks. The ota_in_progress guard below is the safety net
    // for the brief window before handle() blocks and for the post-error path:
    // while an OTA is active we skip ALL normal work (UI render, UART, TCP) so
    // the download owns the PSRAM/SoC bus and the screen does not glitch.
    if (WiFi.status() == WL_CONNECTED) {
        ArduinoOTA.handle();
    }
    if (ota_in_progress) {
        delay(10);  // yield to WiFi/flash; no UI/UART/TCP during the update
        return;
    }

    // --- Deferred firmware-update requests (run OUTSIDE the LVGL event path) -
    // The CONFIG-tab buttons only latch g_fw_request; the actual (long,
    // blocking) flash runs here so it never re-enters lv_timer_handler. Both
    // flows reboot on completion; the ESP32 error path returns here with the
    // panel/touch intact so the operator can read the message and retry.
    if (g_fw_request != FW_REQ_NONE) {
        uint8_t req = g_fw_request;
        g_fw_request = FW_REQ_NONE;
        if (req == FW_REQ_ESP32)
            updateESP32FromSD();
        else if (req == FW_REQ_STM32)
            flashSTM32FromSD();
        return;
    }

    // --- Normal UI servicing (only when NOT doing OTA) ---
    lv_timer_handler();

    // --- Post-boot display drift recovery (REMOVED) -------------------------
    // Previously the panel was re-aligned 3x over the first ~9 s (at 2/5/9 s) to
    // recover from the scan-out "drift" caused by the non-IRAM-safe RGB refill
    // ISR being starved during the flash-heavy early boot (NVS + WiFi RF cal).
    // That root cause is now fixed: the firmware executes from PSRAM (XIP) with
    // an IRAM-safe refill path, so the panel no longer drifts on boot. The three
    // periodic resyncs were therefore redundant and each caused a brief visible
    // flicker, so they have been removed for a clean, flicker-free startup. The
    // resyncDisplayPanel() helper is retained for manual recovery if ever needed.

    // --- Deferred firmware-update completion popup --------------------------
    // A firmware update that rebooted the ESP32 stashed its result in RTC
    // memory; setup() latched it into boot_fw_popup_pending. Show it ONCE, after
    // a short settle (FW_BOOT_POPUP_DELAY_MS, now 300ms) post-boot — the
    // framebuffer clear + dual DMA restart already ran in setup() and the panel
    // is solid from the first frame (XIP). This is gated to the boot window and
    // runs at most once per boot, so it never interferes with a running update.
    if (boot_fw_popup_pending && setup_done_ms > 0 &&
        (now_ms - setup_done_ms) >= FW_BOOT_POPUP_DELAY_MS) {
        boot_fw_popup_pending = false;  // one-shot
        show_firmware_result_popup(boot_fw_popup_success, boot_fw_popup_msg,
                                   boot_fw_popup_device);
        Serial.println("[Boot] Showed deferred firmware-update popup");
    }

    // --- Phase 1: fallback timeout – send config if no BOOT msg received ---
    if (!config_sent && !stm32_booted && setup_done_ms > 0 &&
        (now_ms - setup_done_ms) > BOOT_TIMEOUT_MS) {
        Serial.println("[Boot] No BOOT message – sending config via fallback");
        sendBootConfig();
    }

    // --- Existing logic ---
    ensureWiFiAndServer();
    pollStm32Uart();
    serviceReadyHeartbeat();

    static uint32_t lastStatusReqMs = 0;
    uint32_t now = millis();

    // Dual-path voltage forwarding over TCP:
    // 1) raw STATUS2 at 500ms for high-resolution graph/calc consumers
    if ((now - lastStatus2Forward) > STATUS2_INTERVAL) {
        if (hasRawStatus2Data) {
            sendToPi(rawStatus2Packet);
            lastStatus2Forward = now;
        }
    }

