farmertan81/Spot-Welder/ESP32_8048S043C/src/main.cpp
    // 2) smoothed DISPLAY at 1000ms for stable UI labels
    if ((now - lastDisplayUpdate) > DISPLAY_INTERVAL) {
        if (hasRawStatus2Data) {
            sendToPi(buildDisplayPacket());
            lastDisplayUpdate = now;
        }
    }

    if ((now - lastStatusReqMs) >= 1000) {
        requestStm32Status();
        lastStatusReqMs = now;
    }

    // Guaranteed periodic STATUS push to Flask (every 2s), INDEPENDENT of the
    // STM32 STATUS response path above. The normal path only forwards a STATUS
    // to Flask when the STM32 replies; if the STM32 is briefly busy/quiet, the
    // dashboard could stall on stale values. This fallback ensures control_mode,
    // joule_target_j and the rest are pushed continuously even with no activity.
    static uint32_t lastStatusPushMs = 0;
    if (client && client.connected() && (now - lastStatusPushMs) >= 2000) {
        if ((now - lastStatusForwardMs) >= STATUS_FORWARD_MIN_INTERVAL_MS) {
            String s = buildStatus();
            Serial.printf("[TCP] Periodic STATUS -> Flask (mode=%u target=%.1fJ)\n",
                          (unsigned)control_mode, (double)joule_target_j);
            sendToPi(s);
            lastStatusForwardMs = now;
        }
        lastStatusPushMs = now;
    }

    if (WiFi.status() == WL_CONNECTED) {
        WiFiClient newClient = server.accept();
        if (newClient) {
            if (client && client.connected()) {
                Serial.println(
                    "[TCP] New client arrived -> dropping old client");
                client.stop();
            }

            client = newClient;
            client.setNoDelay(true);
            Serial.println("[TCP] Client connected from " +
                           client.remoteIP().toString());

            lastTcpRxMs = millis();
            setUiConnected(true);
            Serial.printf("[TCP] Flask connected -> sending STATUS immediately "
                          "(mode=%u target=%.1fJ)\n",
                          (unsigned)control_mode, (double)joule_target_j);
            sendToPi(buildStatus());
            syncSettingsAfterUiReconnect();
            requestStm32Status();
        }

        if (client && !client.connected()) {
            Serial.println("[TCP] Client disconnected");
            client.stop();
            setUiConnected(false);
        }

        if (client && client.connected() && TCP_IDLE_TIMEOUT_MS > 0) {
            if ((millis() - lastTcpRxMs) > TCP_IDLE_TIMEOUT_MS) {
                Serial.println("[TCP] Idle timeout -> dropping client");
                client.stop();
                setUiConnected(false);
            }
        }

        if (client && client.connected() && client.available()) {
            String line = client.readStringUntil('\n');
            line.trim();
            if (line.length() > 0) {
                lastTcpRxMs = millis();
                Serial.printf("[TCP] RX: %s\n", line.c_str());
                processCommand(line);
            }
        }
    }

    handleButton();

    // --- Drive UI touch-active flag from hardware touch driver state ---
    {
        bool hw_touch = (touch_filter.state == TOUCH_PRESSED ||
                         touch_filter.state == TOUCH_PENDING_PRESS ||
                         touch_filter.state == TOUCH_PENDING_RELEASE);
        ui_set_touch_active(hw_touch);
    }

    // --- Update on-screen UI (display-smoothing applied inside helper) ---
    // (Unreachable during OTA: loop() returns early above while ota_in_progress.)
    updateScreenDisplay();

    delay(5);
}

